[
    {
    "sender": "partner",
    "text": "Carter looks at her “I’d say memory things, so photos and stuff first. Clothes and toiletries can be replaced, memories can’t.”",
    "time": "2020-05-24T14:01:15"
  },
  {
    "sender": "you",
    "text": "Kai opened her bag and smiled softly, thinking about what to pack first.",
    "time": "2020-05-24T14:01:16"
  },
  {
    "sender": "partner",
    "text": "Carter smiles happily and opens her drawers to help her, glancing at her lovingly",
    "time": "2020-05-24T14:01:17"
  },
  {
    "sender": "you",
    "text": "Kai smiled and cuddled into him cutely before heading to kiss back. She giggled and headed to get her suitcase out of her closet.",
    "time": "2020-05-24T14:01:18"
  },
  {
    "sender": "partner",
    "text": "“I can’t wait to grow old with you”",
    "time": "2020-05-24T14:01:19"
  },
  {
    "sender": "partner",
    "text": "Carter blushes and kisses her softly for a second “I feel the same way baby” he whispers and caresses her cheek",
    "time": "2020-05-24T14:01:20"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly as they got to her room. She got butterflies in her stomach as she thought of all the possibilities for their future together. “I’ll love whatever it is babe. As long as I’m with you” she explained.",
    "time": "2020-05-24T14:01:21"
  },
  {
    "sender": "partner",
    "text": "He looks at her shyly",
    "time": "2020-05-24T14:01:22"
  },
  {
    "sender": "partner",
    "text": "“I hope you like our new place”",
    "time": "2020-05-24T14:01:23"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her cheek and leans against he",
    "time": "2020-05-24T14:01:24"
  },
  {
    "sender": "you",
    "text": "Kai took his hand and led him upstairs happily.",
    "time": "2020-05-24T14:01:25"
  },
  {
    "sender": "partner",
    "text": "Carter dries his hands “Lead the way then” he grins",
    "time": "2020-05-24T14:01:26"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “Of course love” she said happily.",
    "time": "2020-05-24T14:01:27"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “Would you like help?”",
    "time": "2020-05-24T14:01:28"
  },
  {
    "sender": "you",
    "text": "Kai blushed gently. “I should probably start packing” she said softly",
    "time": "2020-05-24T14:01:29"
  },
  {
    "sender": "partner",
    "text": "Carter looks back into hers lovingly",
    "time": "2020-05-24T14:01:30"
  },
  {
    "sender": "you",
    "text": "Kai slowly pulled away from the kiss, looking him in the eye.",
    "time": "2020-05-24T14:01:31"
  },
  {
    "sender": "partner",
    "text": "Carter pulls her closer, pressing their bodies together",
    "time": "2020-05-24T14:01:32"
  },
  {
    "sender": "you",
    "text": "Kai smiled happily against his lips, focused on him and only him.",
    "time": "2020-05-24T14:01:33"
  },
  {
    "sender": "partner",
    "text": "Carter kisses back happily, wrapping his arms around her",
    "time": "2020-05-24T14:01:34"
  },
  {
    "sender": "you",
    "text": "Kai kisses him back, so entranced by his lips that she didn’t care.",
    "time": "2020-05-24T14:01:35"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her and playfully splashes her with some water",
    "time": "2020-05-24T14:01:36"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly, enjoying his warm embrace.",
    "time": "2020-05-24T14:01:37"
  },
  {
    "sender": "partner",
    "text": "Carter grins “Good” he leans against her softly",
    "time": "2020-05-24T14:01:38"
  },
  {
    "sender": "you",
    "text": "Kai nodded happily. “I’m great love” she said sweetly",
    "time": "2020-05-24T14:01:39"
  },
  {
    "sender": "partner",
    "text": "Carter blushes softly and looks at her “You okay babe?”",
    "time": "2020-05-24T14:01:40"
  },
  {
    "sender": "you",
    "text": "Kai blushed gently and came over, kissing his cheek.",
    "time": "2020-05-24T14:01:41"
  },
  {
    "sender": "partner",
    "text": "Carter winks at her as he washes and dries up",
    "time": "2020-05-24T14:01:42"
  },
  {
    "sender": "you",
    "text": "Kai giggles happily and continued eyeing him",
    "time": "2020-05-24T14:01:43"
  },
  {
    "sender": "partner",
    "text": "He looks back at them",
    "time": "2020-05-24T14:01:44"
  },
  {
    "sender": "partner",
    "text": "Carter playfully wiggles his butt for her slightly, as he washes their plates up",
    "time": "2020-05-24T14:01:45"
  },
  {
    "sender": "you",
    "text": "Kai watched him, in love. // Her mom chuckled at how smitten she was.",
    "time": "2020-05-24T14:01:46"
  },
  {
    "sender": "partner",
    "text": "Carter holds her hand for a second before going to wash up",
    "time": "2020-05-24T14:01:47"
  },
  {
    "sender": "you",
    "text": "Kai giggles cutely and went ahead, finishing her food as well.",
    "time": "2020-05-24T14:01:48"
  },
  {
    "sender": "partner",
    "text": "He finishes his food",
    "time": "2020-05-24T14:01:49"
  },
  {
    "sender": "partner",
    "text": "Carter smiles widely and looks at her mother",
    "time": "2020-05-24T14:01:50"
  },
  {
    "sender": "you",
    "text": "Kai smiled as she noticed her mom fawning over how in love they were.",
    "time": "2020-05-24T14:01:51"
  },
  {
    "sender": "partner",
    "text": "Carter blushes and purrs softly into her ear",
    "time": "2020-05-24T14:01:52"
  },
  {
    "sender": "you",
    "text": "Kai snuggled into him cutely and nuzzles his neck.",
    "time": "2020-05-24T14:01:53"
  },
  {
    "sender": "partner",
    "text": "Carter holds her close happily, enjoying finally being able to have her",
    "time": "2020-05-24T14:01:54"
  },
  {
    "sender": "you",
    "text": "Kai smiled cutely and ate happily. She stayed close in his embrace.",
    "time": "2020-05-24T14:01:55"
  },
  {
    "sender": "partner",
    "text": "Kai holds her hand openly, smiling at them both",
    "time": "2020-05-24T14:01:56"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and blushed hard. || Her mom started to eat as well",
    "time": "2020-05-24T14:01:57"
  },
  {
    "sender": "partner",
    "text": "Carter blows her a kiss",
    "time": "2020-05-24T14:01:58"
  },
  {
    "sender": "you",
    "text": "Kai gave him his plate and got them something to drink.",
    "time": "2020-05-24T14:01:59"
  },
  {
    "sender": "partner",
    "text": "Carter kisses Kai’s cheek and sits down to eat",
    "time": "2020-05-24T14:02:00"
  },
  {
    "sender": "you",
    "text": "Her mom heard him and looked toward the smirking, amused and intrigued. “Hm.” Was all she said. || Kai blushes hard and just came to eat some spaghetti, making him and her a plate.",
    "time": "2020-05-24T14:02:01"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Okay. Just making sure we didn’t ruin their lives when they came to interrupt our lovemaking session on the hill.”",
    "time": "2020-05-24T14:02:02"
  },
  {
    "sender": "you",
    "text": "Kai snuggling into him, staying close.",
    "time": "2020-05-24T14:02:03"
  },
  {
    "sender": "you",
    "text": "Her mom looked confused. “What do you mean? The people that their parents picked for them are still out there. You two were also interruptions in their love stories. Their parents had to let nature take its course too. Just like you’ll have to do for your kids...” she said gently.",
    "time": "2020-05-24T14:02:04"
  },
  {
    "sender": "partner",
    "text": "He holds Kai close needily, his head in her hair",
    "time": "2020-05-24T14:02:05"
  },
  {
    "sender": "partner",
    "text": "“What will happen to River and Christina?”",
    "time": "2020-05-24T14:02:06"
  },
  {
    "sender": "you",
    "text": "Her mom finished cooking spaghetti. “What other questions do you have?” || Kai stayed in his embrace.",
    "time": "2020-05-24T14:02:07"
  },
  {
    "sender": "partner",
    "text": "Carter nods “I half understand”",
    "time": "2020-05-24T14:02:08"
  },
  {
    "sender": "you",
    "text": "Her mom nodded. “If we ever break nature’s course, it would change your matches to people unknown or worse. It could’ve changed both of you to colorless....” she said gently. || Kai looked confused. “There’s colorless people out there...”",
    "time": "2020-05-24T14:02:09"
  },
  {
    "sender": "partner",
    "text": "Carter nods “But he was treating her badly, and you knew he wasn’t the one for her” he says softly",
    "time": "2020-05-24T14:02:10"
  },
  {
    "sender": "you",
    "text": "Her mom heard and nodded. “We aren’t allowed to tell you that you two are mates. It’s apart of the contract. We have to let nature take its course.” She said gently. || Kai looked at her mom and took the credit card, looking over at her curiously.",
    "time": "2020-05-24T14:02:11"
  },
  {
    "sender": "partner",
    "text": "Carter nods and takes one of the credit cards quietly",
    "time": "2020-05-24T14:02:12"
  },
  {
    "sender": "you",
    "text": "Her mom nodded. “But I want you two to move into the apartment they bought. Then once you decide to marry and have kids, we’ll go house hunting. And here you go” she said pulling two black credit cards out here purse and handing it to them.",
    "time": "2020-05-24T14:02:13"
  },
  {
    "sender": "partner",
    "text": "“So why did you accept Kai dating River?”",
    "time": "2020-05-24T14:02:14"
  },
  {
    "sender": "partner",
    "text": "Carter nods “I understand ma’am”",
    "time": "2020-05-24T14:02:15"
  },
  {
    "sender": "you",
    "text": "Kai looked surprised. “Oh there’s no way in hell shes getting a wedding invite....” she said gently. || Her mom nodded. “I was supposed to adopt you once they died but I couldn’t because then you two wouldn’t have been able to have married...” she explained.",
    "time": "2020-05-24T14:02:16"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “Took me for the inheritance and then kicked me out. Which is why I used to live in that grothole.”",
    "time": "2020-05-24T14:02:17"
  },
  {
    "sender": "you",
    "text": "Kai looked at him confused. “What’d your aunt do?” She asked. || Her mom continued to cook gently.",
    "time": "2020-05-24T14:02:18"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Makes sense. Also makes sense why my aunt did what she did. But this is worth it.” He says gently",
    "time": "2020-05-24T14:02:19"
  },
  {
    "sender": "you",
    "text": "Kai looked at the two surprised. “Oh wow”",
    "time": "2020-05-24T14:02:20"
  },
  {
    "sender": "you",
    "text": "Her mom nodded. “They have me access to the bank account for you two. To get you a place, then eventually a family home. As well as pay for your wedding and college funds...” she explained.",
    "time": "2020-05-24T14:02:21"
  },
  {
    "sender": "partner",
    "text": "Carter nods “My parents must have sectioned off part of their money”",
    "time": "2020-05-24T14:02:22"
  },
  {
    "sender": "you",
    "text": "Her mom chuckled. “Yeah, I’ve been thinking about it too....” she said softly. “But I think you shouldn’t buy a place.... cause we already did.” She said softly. || Kai looked confused. “You did? Wait- who’s we?” She asked gently.",
    "time": "2020-05-24T14:02:23"
  },
  {
    "sender": "partner",
    "text": "“Not that I don’t appreciate your hospitality ma’am, but I’d hate to cause any awkward moments”",
    "time": "2020-05-24T14:02:24"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and kissed his cheek. “Speaking of. We’ve kind of been thinking about getting our own place...”|| Her mom nodded.",
    "time": "2020-05-24T14:02:25"
  },
  {
    "sender": "partner",
    "text": "Carter cuddles back, a tear in his eye “Thank you” he says softly",
    "time": "2020-05-24T14:02:26"
  },
  {
    "sender": "you",
    "text": "Her mom nodded and sighed. “Yeah, that was their dying wish. For you two to reconnect with one another an get married. They did really want to grow to see their grand babies though” she said remembering what they talked about. || Kaiya came over to carter and cuddled to his chest.",
    "time": "2020-05-24T14:02:27"
  },
  {
    "sender": "partner",
    "text": "Carter smiles softly “I’m glad they’ll be happy then. I miss them.” He says softly",
    "time": "2020-05-24T14:02:28"
  },
  {
    "sender": "you",
    "text": "Kai looked between her mom and carter surprised.",
    "time": "2020-05-24T14:02:29"
  },
  {
    "sender": "you",
    "text": "Her mom nodded. “Yep and we can’t reveal anything to you until after you’ve gained color again. I knew you and carter were meant to be together when you were inseparable back then. Your parents and I saw the ways you two looked at each other. So we went ahead and matched you two together. Picking blue because you two first met getting blue icees in class” she explained.",
    "time": "2020-05-24T14:02:30"
  },
  {
    "sender": "partner",
    "text": "Carter’s eyes widen too “What?”",
    "time": "2020-05-24T14:02:31"
  },
  {
    "sender": "you",
    "text": "Her mom was cooking as she spoke. “It’s a right is passage. When you have a kid, once they get in kindergarten, you and other parents pick who their match is and then pick their color...” she said revealing a major secret about life. || Kai heard and looked at her mom with wide eyed.",
    "time": "2020-05-24T14:02:32"
  },
  {
    "sender": "partner",
    "text": "He plays with his fingers nervously",
    "time": "2020-05-24T14:02:33"
  },
  {
    "sender": "partner",
    "text": "“Pick me? How?”",
    "time": "2020-05-24T14:02:34"
  },
  {
    "sender": "you",
    "text": "Her mom chuckled at his look. “You know I picked you for my daughter. And I’m proud to say that I picked sooo well.” She admitted. || Kai was humming as she looked for some candy all the way at the pantry.",
    "time": "2020-05-24T14:02:35"
  },
  {
    "sender": "partner",
    "text": "Carter blushes deeply and looks down shyly",
    "time": "2020-05-24T14:02:36"
  },
  {
    "sender": "you",
    "text": "Her mom shook her head. “If I had a man like you, I’d let him hit it raw. So I know she’s letting you do it.” || Kai smirked and kissed his cheek before going to the pantry.",
    "time": "2020-05-24T14:02:37"
  },
  {
    "sender": "partner",
    "text": "Carter hears them both and blushes “So you’re not mad, ma’am?”",
    "time": "2020-05-24T14:02:38"
  },
  {
    "sender": "you",
    "text": "Kai looked at him and giggled. “Do we though?” She asked him smirking playfully. || Her mom chuckled at her daughter. “Hmph. Like mother, like daughter.” She said as she walked and started dinner.",
    "time": "2020-05-24T14:02:39"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles “We use contraceptives ma’am”",
    "time": "2020-05-24T14:02:40"
  },
  {
    "sender": "you",
    "text": "Her mom nodded. “As long as my grandkids are raised well, I don’t care...” || Kai blushes gently. “Mom. I’m not pregnant” she said cutely, whining a bit.",
    "time": "2020-05-24T14:02:41"
  },
  {
    "sender": "partner",
    "text": "Carter shrugs “We both have been for a while. With each other, a day or so.” He says honestly, not wanting to lie to his future mother-in-law",
    "time": "2020-05-24T14:02:42"
  },
  {
    "sender": "you",
    "text": "Her mom chuckled. “So I’m guessing that was your way of telling me you’re sexually active now” || Kai blushes shyly and held his hand back as she cuddled close to his chest.",
    "time": "2020-05-24T14:02:43"
  },
  {
    "sender": "partner",
    "text": "Carter shrugs “Sounds like two lovebirds just visiting an old haunt to celebrate each other, nothing too devious.” He smiles, holding Kai’s hand",
    "time": "2020-05-24T14:02:44"
  },
  {
    "sender": "you",
    "text": "“There’s word going around that two teens were being disruptive at the old campgrounds we used to go to. Do you two know anything about that?” Her mom asked smirking as she ran the dishwasher. || Kai looked over at carter blushing hard. “Oh um not really”",
    "time": "2020-05-24T14:02:45"
  },
  {
    "sender": "partner",
    "text": "Carter smiles “A rollercoaster” he says playfully",
    "time": "2020-05-24T14:02:46"
  },
  {
    "sender": "you",
    "text": "Kai giggles a little and smirked getting off the counter. || “pretty good. How was your night with my daughter?” She asked smirking gently.",
    "time": "2020-05-24T14:02:47"
  },
  {
    "sender": "partner",
    "text": "Carter puts the steak knife down “Ma’am, how was your night?”",
    "time": "2020-05-24T14:02:48"
  },
  {
    "sender": "you",
    "text": "Kai noticed him and looked at him shocked.|| Her mon came into the kitchen and noticed the scene.",
    "time": "2020-05-24T14:02:49"
  },
  {
    "sender": "partner",
    "text": "Carter looks on guard, picking up a steak knife and hiding it behind his arm",
    "time": "2020-05-24T14:02:50"
  },
  {
    "sender": "you",
    "text": "Kai then heard the front door open and pulled away confused",
    "time": "2020-05-24T14:02:51"
  },
  {
    "sender": "partner",
    "text": "Carter kisses back deeply, feeling the same about her",
    "time": "2020-05-24T14:02:52"
  },
  {
    "sender": "you",
    "text": "Kai sat up and kissed him passionately, in love with him.",
    "time": "2020-05-24T14:02:53"
  },
  {
    "sender": "partner",
    "text": "Carter moves his head away and looks at her",
    "time": "2020-05-24T14:02:54"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip, thankful she had a man that knew exactly how to pleasure her.",
    "time": "2020-05-24T14:02:55"
  },
  {
    "sender": "partner",
    "text": "Carter smirks and licks up the left overs",
    "time": "2020-05-24T14:02:56"
  },
  {
    "sender": "you",
    "text": "Kai felt it and moaned softly, humming gently.",
    "time": "2020-05-24T14:02:57"
  },
  {
    "sender": "partner",
    "text": "Carter smiles and drinks down her cum happily",
    "time": "2020-05-24T14:02:58"
  },
  {
    "sender": "you",
    "text": "Kai moaned more, feeling it as she climaxed in his mouth, as happy as can be.",
    "time": "2020-05-24T14:02:59"
  },
  {
    "sender": "partner",
    "text": "Carter pins her to the kitchen counter as he eats her out hungrily",
    "time": "2020-05-24T14:03:00"
  },
  {
    "sender": "you",
    "text": "Kai moaned happily, her pussy feeling amazing with him inside.",
    "time": "2020-05-24T14:03:01"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles more and keeps doing it, trying to pleasure his girl",
    "time": "2020-05-24T14:03:02"
  },
  {
    "sender": "you",
    "text": "Kai moaned enjoying his tongue. “Mmm daddy. It feels so good” she said gently and bit her lip.",
    "time": "2020-05-24T14:03:03"
  },
  {
    "sender": "partner",
    "text": "Carter smirks and slips his tongue into her core, rubbing her insides",
    "time": "2020-05-24T14:03:04"
  },
  {
    "sender": "you",
    "text": "Kai nodded happily. “Mmmm yes, yes it is” she said moving her hips around as he ate her out.",
    "time": "2020-05-24T14:03:05"
  },
  {
    "sender": "partner",
    "text": "Carter smirks “Is that so?” He teases huskily",
    "time": "2020-05-24T14:03:06"
  },
  {
    "sender": "you",
    "text": "Kai felt it and bit her lip, blushing hard. “Mmm daddy is so sexy”",
    "time": "2020-05-24T14:03:07"
  },
  {
    "sender": "partner",
    "text": "Carter smiles “I love you too” he traces a loveheart on her clit with his tongue",
    "time": "2020-05-24T14:03:08"
  },
  {
    "sender": "you",
    "text": "Kai smirked gently. “I love you” she spoke softly.",
    "time": "2020-05-24T14:03:09"
  },
  {
    "sender": "partner",
    "text": "Carter smirks “Yes princess?” He whispers against her skin, his breath hitting her bare core",
    "time": "2020-05-24T14:03:10"
  },
  {
    "sender": "you",
    "text": "Kai was in complete bliss as she couldn’t help but lay back on the counter. “Mmm carter” she moaned softly.",
    "time": "2020-05-24T14:03:11"
  },
  {
    "sender": "partner",
    "text": "Carter smirks and nuzzles his nose against her clit",
    "time": "2020-05-24T14:03:12"
  },
  {
    "sender": "you",
    "text": "Kai felt him hold her legs open and bit her lip gently, moaning a bit more.",
    "time": "2020-05-24T14:03:13"
  },
  {
    "sender": "partner",
    "text": "Carter holds her legs open as he tastes her wetness",
    "time": "2020-05-24T14:03:14"
  },
  {
    "sender": "you",
    "text": "Kai moaned ever so softly, her head falling back.",
    "time": "2020-05-24T14:03:15"
  },
  {
    "sender": "partner",
    "text": "Carter teases her entrance with the tip of his tongue",
    "time": "2020-05-24T14:03:16"
  },
  {
    "sender": "you",
    "text": "Kai felt it and bit her lip more.",
    "time": "2020-05-24T14:03:17"
  },
  {
    "sender": "partner",
    "text": "Carter gives her a gentle teasing lick",
    "time": "2020-05-24T14:03:18"
  },
  {
    "sender": "you",
    "text": "Kai looked back, completely in love.",
    "time": "2020-05-24T14:03:19"
  },
  {
    "sender": "partner",
    "text": "Carter looks up into her eyes lovingly",
    "time": "2020-05-24T14:03:20"
  },
  {
    "sender": "you",
    "text": "Kai gasped and got more moist happily. She watched him.",
    "time": "2020-05-24T14:03:21"
  },
  {
    "sender": "partner",
    "text": "Carter slowly kisses up her thighs",
    "time": "2020-05-24T14:03:22"
  },
  {
    "sender": "you",
    "text": "Kai watched him gently and bit her lip",
    "time": "2020-05-24T14:03:23"
  },
  {
    "sender": "partner",
    "text": "Carter smirks playfully and bends down in front of her",
    "time": "2020-05-24T14:03:24"
  },
  {
    "sender": "you",
    "text": "Kai heard him and gently spread her legs.",
    "time": "2020-05-24T14:03:25"
  },
  {
    "sender": "partner",
    "text": "Carter thinks “Toast with a side of wet pussy?” He teases more",
    "time": "2020-05-24T14:03:26"
  },
  {
    "sender": "you",
    "text": "Kai smirked. “What do you want to eat?”",
    "time": "2020-05-24T14:03:27"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Making love to you on the hill did take energy” he teases",
    "time": "2020-05-24T14:03:28"
  },
  {
    "sender": "you",
    "text": "Kai sat on the counter. “You still hungry?” She asked.",
    "time": "2020-05-24T14:03:29"
  },
  {
    "sender": "partner",
    "text": "Carter turns on the lights and follows her into the kitchen",
    "time": "2020-05-24T14:03:30"
  },
  {
    "sender": "you",
    "text": "Kai smiled and dropped her bag down before heading to the kitchen",
    "time": "2020-05-24T14:03:31"
  },
  {
    "sender": "partner",
    "text": "Carter blushes as he follows her inside",
    "time": "2020-05-24T14:03:32"
  },
  {
    "sender": "you",
    "text": "Kai smiled and headed into her house, her mom not home.",
    "time": "2020-05-24T14:03:33"
  },
  {
    "sender": "partner",
    "text": "Carter eyes her back lovingly",
    "time": "2020-05-24T14:03:34"
  },
  {
    "sender": "you",
    "text": "Kai eyed him before turning off her car and getting out of it.",
    "time": "2020-05-24T14:03:35"
  },
  {
    "sender": "partner",
    "text": "Carter parks beside her car",
    "time": "2020-05-24T14:03:36"
  },
  {
    "sender": "you",
    "text": "Kai smirked and kept driving until they got to her house.",
    "time": "2020-05-24T14:03:37"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles huskily to himself",
    "time": "2020-05-24T14:03:38"
  },
  {
    "sender": "you",
    "text": "Kai looked in the rear view mirror. She saw and giggled blushing hard. She licked her lips eyeing him.",
    "time": "2020-05-24T14:03:39"
  },
  {
    "sender": "partner",
    "text": "Carter drives behind her, winking at her so she could see in her rear view mirror",
    "time": "2020-05-24T14:03:40"
  },
  {
    "sender": "you",
    "text": "Kai pulled out and headed home biting her lip",
    "time": "2020-05-24T14:03:41"
  },
  {
    "sender": "partner",
    "text": "Carter watches her get in and  waits for her to pull out so he could follow",
    "time": "2020-05-24T14:03:42"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and eyed him gently. She blew one back before heading to get in her car.",
    "time": "2020-05-24T14:03:43"
  },
  {
    "sender": "partner",
    "text": "Carter nods and blows her a kiss",
    "time": "2020-05-24T14:03:44"
  },
  {
    "sender": "you",
    "text": "Kai smiled as they got to her car. She got out. “Meet me at my house” she said softly.",
    "time": "2020-05-24T14:03:45"
  },
  {
    "sender": "partner",
    "text": "Carter blushes at her cuteness",
    "time": "2020-05-24T14:03:46"
  },
  {
    "sender": "you",
    "text": "Kai held his hand, smiling happily as she bit her lip cutely.",
    "time": "2020-05-24T14:03:47"
  },
  {
    "sender": "partner",
    "text": "Carter starts the car and holds her hand",
    "time": "2020-05-24T14:03:48"
  },
  {
    "sender": "you",
    "text": "Kai smiled gently and bit her lip happily",
    "time": "2020-05-24T14:03:49"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Your car it is then” he smiles",
    "time": "2020-05-24T14:03:50"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “Oh yeah I should probably get my car” she said as she had completely forgotten about it.",
    "time": "2020-05-24T14:03:51"
  },
  {
    "sender": "partner",
    "text": "Carter sits in the driver’s seat “Home or your car?”",
    "time": "2020-05-24T14:03:52"
  },
  {
    "sender": "you",
    "text": "Kai smiled and stayed cuddled into his jacket.",
    "time": "2020-05-24T14:03:53"
  },
  {
    "sender": "partner",
    "text": "Carter gently closes the door after her and gets in the driver’s seat",
    "time": "2020-05-24T14:03:54"
  },
  {
    "sender": "you",
    "text": "Kai gets in the car, feeling like a huge weight was lifted off her shoulders",
    "time": "2020-05-24T14:03:55"
  },
  {
    "sender": "partner",
    "text": "Carter opens the car door for her",
    "time": "2020-05-24T14:03:56"
  },
  {
    "sender": "you",
    "text": "Kai nodded and bit her lip. “Yes, yes we do”",
    "time": "2020-05-24T14:03:57"
  },
  {
    "sender": "partner",
    "text": "Carter nods and blushes softly “We have our entire lives to explore”",
    "time": "2020-05-24T14:03:58"
  },
  {
    "sender": "you",
    "text": "Kai smiled and kissed his cheek. “Yep. And there’s so much more we can do” she said smirking.",
    "time": "2020-05-24T14:03:59"
  },
  {
    "sender": "partner",
    "text": "Carter smiles “Not bad for our second time, huh?”",
    "time": "2020-05-24T14:04:00"
  },
  {
    "sender": "you",
    "text": "Kai smiled as they headed back to the car gently.",
    "time": "2020-05-24T14:04:01"
  },
  {
    "sender": "partner",
    "text": "Carter cuddles back happily and kisses her cheek",
    "time": "2020-05-24T14:04:02"
  },
  {
    "sender": "you",
    "text": "Kai smiled and cuddled into him happily, holding on to the jacket.",
    "time": "2020-05-24T14:04:03"
  },
  {
    "sender": "partner",
    "text": "Carter pecks back lovingly and gets dressed, giving her his blue jacket, draping it over her shoulders",
    "time": "2020-05-24T14:04:04"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and pecked his lips. “You’re welcome”",
    "time": "2020-05-24T14:04:05"
  },
  {
    "sender": "partner",
    "text": "Carter smiles happily and holds them close “Thank you babe”",
    "time": "2020-05-24T14:04:06"
  },
  {
    "sender": "you",
    "text": "Kai finished getting dressed but gave him her panties, which just so happened to be blue.",
    "time": "2020-05-24T14:04:07"
  },
  {
    "sender": "partner",
    "text": "Carter smirks happily and helps her her dressed",
    "time": "2020-05-24T14:04:08"
  },
  {
    "sender": "you",
    "text": "Kai smirked playfully at him and pecked his lips before getting dressed",
    "time": "2020-05-24T14:04:09"
  },
  {
    "sender": "partner",
    "text": "“I know you are” he teases playfully",
    "time": "2020-05-24T14:04:10"
  },
  {
    "sender": "you",
    "text": "Kai moaned as he pulled away. “That’s so hot”",
    "time": "2020-05-24T14:04:11"
  },
  {
    "sender": "partner",
    "text": "Carter nods and pulls out, a string of her wetness connecting his shaft to her",
    "time": "2020-05-24T14:04:12"
  },
  {
    "sender": "you",
    "text": "Kai blushed hard and eyed him. “We should probably get home...” she said noticing how late it was.",
    "time": "2020-05-24T14:04:13"
  },
  {
    "sender": "partner",
    "text": "Carter’s eyes were full of love for her",
    "time": "2020-05-24T14:04:14"
  },
  {
    "sender": "you",
    "text": "Kai looked in his eyes, completely in love.",
    "time": "2020-05-24T14:04:15"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles huskily and caresses her cheek",
    "time": "2020-05-24T14:04:16"
  },
  {
    "sender": "you",
    "text": "Kai playfully glared back at him, enjoying how stuffed she was.",
    "time": "2020-05-24T14:04:17"
  },
  {
    "sender": "partner",
    "text": "Carter nods back “Good girl” he smirks playfully",
    "time": "2020-05-24T14:04:18"
  },
  {
    "sender": "you",
    "text": "Kai nodded, breathing deeply.  “Yes daddy.” She moaned softly.",
    "time": "2020-05-24T14:04:19"
  },
  {
    "sender": "partner",
    "text": "Carter smirks “I own you” he whispers teasingly “You’re mine and only mine”",
    "time": "2020-05-24T14:04:20"
  },
  {
    "sender": "you",
    "text": "Kai moaned at his dominance as her body was shaking from its second climax.",
    "time": "2020-05-24T14:04:21"
  },
  {
    "sender": "partner",
    "text": "Carter feels her squirt and smirks “Yes princess?” He pins her hands above her head so she can’t move",
    "time": "2020-05-24T14:04:22"
  },
  {
    "sender": "you",
    "text": "Kai moaned his name loud, her back arching once again as she was completely wrapped around his finger. “Fuck daddy!” She moaned louder as she squirted.",
    "time": "2020-05-24T14:04:23"
  },
  {
    "sender": "partner",
    "text": "Carter thrusts firmly, wanting to make her body his property, being rough and hard to show his passion",
    "time": "2020-05-24T14:04:24"
  },
  {
    "sender": "you",
    "text": "Kai moaned happily, her walls enjoyed stretching around his cock.",
    "time": "2020-05-24T14:04:25"
  },
  {
    "sender": "partner",
    "text": "Carter smirks “Isn’t that the point?” He doesn’t slow down, watching her free boob bounce as they make rough love",
    "time": "2020-05-24T14:04:26"
  },
  {
    "sender": "you",
    "text": "Kai moaned surprised by his strong sex drive. “Shit, you’re destroying my guts” she moaned happily, spreading her legs more.",
    "time": "2020-05-24T14:04:27"
  },
  {
    "sender": "partner",
    "text": "Carter was ploughing into her body like a piston “Yes Kai?” He grunts into her skin",
    "time": "2020-05-24T14:04:28"
  },
  {
    "sender": "you",
    "text": "Kai moaned loud, gasping at how fast he was thrusting into her. “Shit, Carter!” She moaned of pleasure.",
    "time": "2020-05-24T14:04:29"
  },
  {
    "sender": "partner",
    "text": "Carter takes one of her nipples into his mouth as he takes her tight pussy hard",
    "time": "2020-05-24T14:04:30"
  },
  {
    "sender": "you",
    "text": "Kai smirked, completely turned on by everything he does.",
    "time": "2020-05-24T14:04:31"
  },
  {
    "sender": "partner",
    "text": "Carter smirks “Says you baby. You have the perfect body, I can’t wait to mark every inch of it.”",
    "time": "2020-05-24T14:04:32"
  },
  {
    "sender": "you",
    "text": "Kai nodded and moaned gently. “Fuck, you’re so hot”",
    "time": "2020-05-24T14:04:33"
  },
  {
    "sender": "partner",
    "text": "Carter smirks back “I’d like that” he tugs on her nipples gently “That way I won’t have to gag you so you’re quiet” he teases",
    "time": "2020-05-24T14:04:34"
  },
  {
    "sender": "you",
    "text": "Kai moaned more, enjoying her soulmate. “Mmm or we could just get our own place” she mentioned, smirking a little.",
    "time": "2020-05-24T14:04:35"
  },
  {
    "sender": "partner",
    "text": "Carter eyes her back, moving his hips faster to pleasure her “We should get your mom ear plugs then”",
    "time": "2020-05-24T14:04:36"
  },
  {
    "sender": "you",
    "text": "Kai moaned eyeing him. “Mmm, just take me. You don’t even have to ask baby....” she said gently.",
    "time": "2020-05-24T14:04:37"
  },
  {
    "sender": "partner",
    "text": "He teases, his hands roaming her body",
    "time": "2020-05-24T14:04:38"
  },
  {
    "sender": "partner",
    "text": "Carter smirks “And if I want to fuck you?”",
    "time": "2020-05-24T14:04:39"
  },
  {
    "sender": "you",
    "text": "Kai moaned happily, feeling how deep he was. “Oh fuck yes!” She moaned",
    "time": "2020-05-24T14:04:40"
  },
  {
    "sender": "partner",
    "text": "Carter keeps going, pushing deeper into her body “So baby, are you mine?”",
    "time": "2020-05-24T14:04:41"
  },
  {
    "sender": "you",
    "text": "Kai kisses him back moaning loud in his mouth as she climaxed, creaming all over his shaft.",
    "time": "2020-05-24T14:04:42"
  },
  {
    "sender": "partner",
    "text": "Carter kisses Kai and fucks her hard, their bodies slap together",
    "time": "2020-05-24T14:04:43"
  },
  {
    "sender": "you",
    "text": "Kai moaned as her back was still arched. “God, Carter!” She moaned louder. || Christina and River couldn’t take it anymore and just left.",
    "time": "2020-05-24T14:04:44"
  },
  {
    "sender": "partner",
    "text": "“I’m fucking her because when she comforted me at the party, I saw true colour for the first time. I’m fucking her because she asked me to.”",
    "time": "2020-05-24T14:04:45"
  },
  {
    "sender": "you",
    "text": "Kai moaned more at how strong his thrusts were. “Yeah, we’ve both known your sins....” she moaned more as she was getting dominated. || Christina looked hurt and cried. “So you go and fuck her?!” She asked hurt. || River looked pissed off as he just scoffed.",
    "time": "2020-05-24T14:04:46"
  },
  {
    "sender": "partner",
    "text": "Carter rubs her breasts as he looks at Christina “Christina, you cheated, and I know we don’t see the same colour. But me and Kai do, and she’s been honest with me. And as for you River, we know you have a side chick, we know you were planning to get Kai drunk, get one last fuck out of her then dump her.” He keeps thrusting into Kai",
    "time": "2020-05-24T14:04:47"
  },
  {
    "sender": "you",
    "text": "Kai moaned into his lips, completely in love as her back arched. He moans filled the camp ground as she was in heaven with him. || Christina just watched crying. “Please, I’m sorry carter. Please just stop.”",
    "time": "2020-05-24T14:04:48"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her happily as he pounds his soulmate into the grass, his balls slapping against her ass",
    "time": "2020-05-24T14:04:49"
  },
  {
    "sender": "you",
    "text": "Kai moaned happily, surprised by the passion and intensity. “Carter, oh god! It’s so deep!” She moaned his name happily. || Christina watched speechless as she couldn’t do anything but cry.",
    "time": "2020-05-24T14:04:50"
  },
  {
    "sender": "partner",
    "text": "Carter thrusts hard and fast, focussing on Kai and Kai alone",
    "time": "2020-05-24T14:04:51"
  },
  {
    "sender": "you",
    "text": "Kai felt how fast he slid in and gasped, moaning as she realized he was deep in her, raw dogging her tight pussy. “God, I should let you go raw all the time....” she moaned happily. || Christina and River gasped as their eyes both started watering. “God, please Carter, stop!” She said.",
    "time": "2020-05-24T14:04:52"
  },
  {
    "sender": "partner",
    "text": "“Fuck baby” he whispers “Why do you feel so good?” He moans in her ear",
    "time": "2020-05-24T14:04:53"
  },
  {
    "sender": "partner",
    "text": "Carter nods and undresses her again, sliding into her raw. He ignores Christina as he takes his soulmate like he was supposed to.",
    "time": "2020-05-24T14:04:54"
  },
  {
    "sender": "you",
    "text": "Kai shook her head and pulled him back down to kiss him. “You want your revenge on her? Cheating on you so many times.... lying to you about her purity.... nows the time to get it...” she whispered in his ear, before staring in his eyes. || Christina and river noticed the two. “Carter! What are you doing?!” She said as they got out of the car.",
    "time": "2020-05-24T14:04:55"
  },
  {
    "sender": "partner",
    "text": "Carter sees it too and curses. He gives her naked body butterfly kisses and gets her dressed again.",
    "time": "2020-05-24T14:04:56"
  },
  {
    "sender": "you",
    "text": "Kai moaned softly, enjoying his touch as always. She then noticed a car pull up near theirs, and put cane river and Christina.",
    "time": "2020-05-24T14:04:57"
  },
  {
    "sender": "partner",
    "text": "Carter nods and gently pulls her clothes off, still rubbing her to keep her wet for him",
    "time": "2020-05-24T14:04:58"
  },
  {
    "sender": "you",
    "text": "Kai gasped more. “oh god, please carter” she moaned wanting him completely.",
    "time": "2020-05-24T14:04:59"
  },
  {
    "sender": "partner",
    "text": "Carter keeps grinding, almost daring her to ask him to take her",
    "time": "2020-05-24T14:05:00"
  },
  {
    "sender": "you",
    "text": "Kai moaned against his lips more and starting getting even more moist against him, as they basically dry humped.",
    "time": "2020-05-24T14:05:01"
  },
  {
    "sender": "partner",
    "text": "Carter hitches her skirt up and rubs her skin directly. He grinds a bit harder, sensing her wetness.",
    "time": "2020-05-24T14:05:02"
  },
  {
    "sender": "you",
    "text": "Kai enjoyed his sensualness, moaning even more. She needed him inside of her.",
    "time": "2020-05-24T14:05:03"
  },
  {
    "sender": "partner",
    "text": "Carter feels her tongue and moves his to meet hers, rubbing it all over",
    "time": "2020-05-24T14:05:04"
  },
  {
    "sender": "you",
    "text": "Kai moaned more into his lips as she started to French kiss him more. She was in complete bliss.",
    "time": "2020-05-24T14:05:05"
  },
  {
    "sender": "partner",
    "text": "Carter heard her moan and smirks slightly. He looks into her eyes to tease her, wanting to be close to her. He keeps grinding and rubbing, wanting to please her.",
    "time": "2020-05-24T14:05:06"
  },
  {
    "sender": "you",
    "text": "Kai moaned spreading her legs more as they grinded. She kissed him back, enjoying his lips",
    "time": "2020-05-24T14:05:07"
  },
  {
    "sender": "partner",
    "text": "Carter leans in and kisses her deeply, still grinding against her. He rubs her ass too, almost kneading her butt cheeks.",
    "time": "2020-05-24T14:05:08"
  },
  {
    "sender": "you",
    "text": "Kai felt him grind back and got soaking wet, enjoying his touch. She looked in his eyes gently.",
    "time": "2020-05-24T14:05:09"
  },
  {
    "sender": "partner",
    "text": "Carter nods back and grinds back gently, moving his hands to her ass",
    "time": "2020-05-24T14:05:10"
  },
  {
    "sender": "you",
    "text": "Kai nodded gently and smirked, slowly grinding gently against him.",
    "time": "2020-05-24T14:05:11"
  },
  {
    "sender": "partner",
    "text": "Carter looks into her eyes, almost asking if she wanted things to go further",
    "time": "2020-05-24T14:05:12"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and bit her lip, looking at him. “Hm” she said gently",
    "time": "2020-05-24T14:05:13"
  },
  {
    "sender": "partner",
    "text": "Carter blushes as he feels her leg going up his. He eyes her back, his hands on her sides",
    "time": "2020-05-24T14:05:14"
  },
  {
    "sender": "you",
    "text": "Kai felt it and blushed hard, eyeing him lovingly. Her leg running up his slowly as she rested her hands on his chest.",
    "time": "2020-05-24T14:05:15"
  },
  {
    "sender": "partner",
    "text": "Carter blushes at her show of love, purring slightly. He rolls over and kisses the tip of her nose.",
    "time": "2020-05-24T14:05:16"
  },
  {
    "sender": "you",
    "text": "Kai leaned up and kissed his cheek softly. Her gentle kiss displaying her love for him.",
    "time": "2020-05-24T14:05:17"
  },
  {
    "sender": "partner",
    "text": "Carter snuggles back, not wanting to move away from her",
    "time": "2020-05-24T14:05:18"
  },
  {
    "sender": "you",
    "text": "Kai snuggled into him, enjoying the relaxation.",
    "time": "2020-05-24T14:05:19"
  },
  {
    "sender": "partner",
    "text": "He snuggles closer, wanting her warmth close",
    "time": "2020-05-24T14:05:20"
  },
  {
    "sender": "partner",
    "text": "Carter smiles at her warmly, not wanting to break the silence",
    "time": "2020-05-24T14:05:21"
  },
  {
    "sender": "you",
    "text": "Kai smiled as she looked into his eyes more, enjoying their silent intimacy.",
    "time": "2020-05-24T14:05:22"
  },
  {
    "sender": "partner",
    "text": "Carter keeps looking into her eyes, his fingers tracing shapes on her back",
    "time": "2020-05-24T14:05:23"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and butterflies went through her stomach.",
    "time": "2020-05-24T14:05:24"
  },
  {
    "sender": "partner",
    "text": "Carter gazes into her eyes lovingly",
    "time": "2020-05-24T14:05:25"
  },
  {
    "sender": "you",
    "text": "Kai smiled and caught eyes with him",
    "time": "2020-05-24T14:05:26"
  },
  {
    "sender": "partner",
    "text": "Carter grins and looks into her eyes",
    "time": "2020-05-24T14:05:27"
  },
  {
    "sender": "you",
    "text": "Kai giggles cutely and hummed softly.",
    "time": "2020-05-24T14:05:28"
  },
  {
    "sender": "partner",
    "text": "Carter smiles back widely and kisses her nose",
    "time": "2020-05-24T14:05:29"
  },
  {
    "sender": "you",
    "text": "Kai smiled happily, excited to get to be his.",
    "time": "2020-05-24T14:05:30"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Very excited Kai” he says honestly",
    "time": "2020-05-24T14:05:31"
  },
  {
    "sender": "you",
    "text": "Kai hummed, “are you excited?” She asked gently",
    "time": "2020-05-24T14:05:32"
  },
  {
    "sender": "partner",
    "text": "Carter snuggles and strokes her hair slowly",
    "time": "2020-05-24T14:05:33"
  },
  {
    "sender": "you",
    "text": "Kai cuddled into him excited for their new lives together.",
    "time": "2020-05-24T14:05:34"
  },
  {
    "sender": "partner",
    "text": "Carter cuddles back and caresses her cheek “I’m glad I make you happy”",
    "time": "2020-05-24T14:05:35"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and giggled at his response, cuddling close to him.",
    "time": "2020-05-24T14:05:36"
  },
  {
    "sender": "partner",
    "text": "Carter blushes deeply and kisses her cheek “You’re welcome I guess”",
    "time": "2020-05-24T14:05:37"
  },
  {
    "sender": "you",
    "text": "Kai nodded. “Yeah, you really did.” She said softly.",
    "time": "2020-05-24T14:05:38"
  },
  {
    "sender": "partner",
    "text": "Carter blushes “So I saved you?”",
    "time": "2020-05-24T14:05:39"
  },
  {
    "sender": "you",
    "text": "Kai smiled gently “without you, I wouldn’t have ever owned up to the fact that I didn’t see the same color as river” she admitted gently.",
    "time": "2020-05-24T14:05:40"
  },
  {
    "sender": "partner",
    "text": "“What for?” Carter asks softly, looking back into her eyes",
    "time": "2020-05-24T14:05:41"
  },
  {
    "sender": "you",
    "text": "Kai looked into his eyes deeply in love. “Thank you” she said softly.",
    "time": "2020-05-24T14:05:42"
  },
  {
    "sender": "partner",
    "text": "Carter smiles “Thank you for helping me see colour”",
    "time": "2020-05-24T14:05:43"
  },
  {
    "sender": "you",
    "text": "Kai glanced over at him andSmiled weakly, completely in love",
    "time": "2020-05-24T14:05:44"
  },
  {
    "sender": "partner",
    "text": "He looks across at her for a second",
    "time": "2020-05-24T14:05:45"
  },
  {
    "sender": "partner",
    "text": "Carter smiles “Almost as gorgeous as you” he says softly",
    "time": "2020-05-24T14:05:46"
  },
  {
    "sender": "you",
    "text": "Kai looked at it tearing up. “Oh my gosh, it’s so gorgeous...”",
    "time": "2020-05-24T14:05:47"
  },
  {
    "sender": "partner",
    "text": "Carter lays beside her and watches it with her, holding her hand gently",
    "time": "2020-05-24T14:05:48"
  },
  {
    "sender": "you",
    "text": "As the kiss depends,  Kai noticed that the rest of the sunset in front of them turned full color. She slowly pull Ed away from her lips, staring at the full color sunset In front of them.",
    "time": "2020-05-24T14:05:49"
  },
  {
    "sender": "partner",
    "text": "Carter notices it too, deepening the kiss needily",
    "time": "2020-05-24T14:05:50"
  },
  {
    "sender": "you",
    "text": "Kaiya happily loved on him as she remained in his embrace. As they kissed, she started noticing their surroundings become more bright and colorful.",
    "time": "2020-05-24T14:05:51"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her tenderly, holding her close",
    "time": "2020-05-24T14:05:52"
  },
  {
    "sender": "you",
    "text": "Kai kisses him back, their lips moving in sync.",
    "time": "2020-05-24T14:05:53"
  },
  {
    "sender": "partner",
    "text": "(?)",
    "time": "2020-05-24T14:05:54"
  },
  {
    "sender": "partner",
    "text": "He wanted to comfort her",
    "time": "2020-05-24T14:05:55"
  },
  {
    "sender": "partner",
    "text": "Carter ignores his phone and kisses her gently",
    "time": "2020-05-24T14:05:56"
  },
  {
    "sender": "you",
    "text": "Both of their phones were blowing up from people at the party asking what happened, wondering where they went.",
    "time": "2020-05-24T14:05:57"
  },
  {
    "sender": "partner",
    "text": "Carter looks into her eyes lovingly",
    "time": "2020-05-24T14:05:58"
  },
  {
    "sender": "you",
    "text": "Kai blushed hard and looked up into his eyes.",
    "time": "2020-05-24T14:05:59"
  },
  {
    "sender": "partner",
    "text": "Carter blushes “I don’t care what she thinks anymore, I care what you think”",
    "time": "2020-05-24T14:06:00"
  },
  {
    "sender": "you",
    "text": "Kai nodded happily. “I heard, she said you were amazing at it though.”",
    "time": "2020-05-24T14:06:01"
  },
  {
    "sender": "partner",
    "text": "Carter blushes “She was very demanding”",
    "time": "2020-05-24T14:06:02"
  },
  {
    "sender": "you",
    "text": "Kai  smiled softly. “Christins mentioned your sex life with her and I got hella jealous.”",
    "time": "2020-05-24T14:06:03"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles “Doesn’t mean you can’t like it”",
    "time": "2020-05-24T14:06:04"
  },
  {
    "sender": "you",
    "text": "Kai laughed. “It was your idea remember. I just went with it”",
    "time": "2020-05-24T14:06:05"
  },
  {
    "sender": "partner",
    "text": "Carter nods back and smiles “I bet you liked the skinny dipping”",
    "time": "2020-05-24T14:06:06"
  },
  {
    "sender": "you",
    "text": "Kai blushed hard and nodded. “Yeah, I remember our families bringing us over here. And the campfires and skinny dipping...” she said gently.",
    "time": "2020-05-24T14:06:07"
  },
  {
    "sender": "partner",
    "text": "Carter pecks her lips “Remember the times we would camp up here?”",
    "time": "2020-05-24T14:06:08"
  },
  {
    "sender": "you",
    "text": "Kai smiled and giggled laying on top of him",
    "time": "2020-05-24T14:06:09"
  },
  {
    "sender": "partner",
    "text": "Carter lays back at the top and pulls her down on top of him",
    "time": "2020-05-24T14:06:10"
  },
  {
    "sender": "you",
    "text": "Kai followed him up the hills happily.",
    "time": "2020-05-24T14:06:11"
  },
  {
    "sender": "partner",
    "text": "“Come on beautiful” he teases",
    "time": "2020-05-24T14:06:12"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles and leads her up the hill",
    "time": "2020-05-24T14:06:13"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and got out excited.",
    "time": "2020-05-24T14:06:14"
  },
  {
    "sender": "partner",
    "text": "Carter grins and kisses her cheek, parking at the foot of the hill “Let’s go”",
    "time": "2020-05-24T14:06:15"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly knowing almost exactly where they were going",
    "time": "2020-05-24T14:06:16"
  },
  {
    "sender": "partner",
    "text": "Carter smiles back and drove her to their favourite camping spot when they were younger",
    "time": "2020-05-24T14:06:17"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and bit her lip hard.",
    "time": "2020-05-24T14:06:18"
  },
  {
    "sender": "partner",
    "text": "Carter blushes and drives, lacing their fingers together",
    "time": "2020-05-24T14:06:19"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and held his free hand. “I’m always happy when I’m with you”",
    "time": "2020-05-24T14:06:20"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “I love you. I want you to be happy.” He says honestly",
    "time": "2020-05-24T14:06:21"
  },
  {
    "sender": "you",
    "text": "Kai nodded and kissed his cheek.",
    "time": "2020-05-24T14:06:22"
  },
  {
    "sender": "partner",
    "text": "He reaches for her hand “I just wanted things to be goodl",
    "time": "2020-05-24T14:06:23"
  },
  {
    "sender": "partner",
    "text": "Carter nods “True” he says softly",
    "time": "2020-05-24T14:06:24"
  },
  {
    "sender": "you",
    "text": "Kai shook her head. “It’s okay. You just forgot that Christina already knew I see blue...” she said gently.",
    "time": "2020-05-24T14:06:25"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “For making things so messy. I was trying to make things amicable and such, and I failed.”",
    "time": "2020-05-24T14:06:26"
  },
  {
    "sender": "you",
    "text": "Kai looked at him. “For what?” She asked gently",
    "time": "2020-05-24T14:06:27"
  },
  {
    "sender": "partner",
    "text": "“I’m sorry”",
    "time": "2020-05-24T14:06:28"
  },
  {
    "sender": "partner",
    "text": "Carter starts the car and looks at her",
    "time": "2020-05-24T14:06:29"
  },
  {
    "sender": "you",
    "text": "Kai blushed and got in. She hummed happily as she felt like a weight was lifted off her shoulders",
    "time": "2020-05-24T14:06:30"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her cheek and opens the door for her",
    "time": "2020-05-24T14:06:31"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly as they got to the car.",
    "time": "2020-05-24T14:06:32"
  },
  {
    "sender": "partner",
    "text": "Carter holds her hand gently",
    "time": "2020-05-24T14:06:33"
  },
  {
    "sender": "you",
    "text": "Kai smiled and texted river telling him that they were over and that she left.",
    "time": "2020-05-24T14:06:34"
  },
  {
    "sender": "partner",
    "text": "Carter nods and leads her out",
    "time": "2020-05-24T14:06:35"
  },
  {
    "sender": "you",
    "text": "Kai smiled. “Let’s go somewhere. Away from here.” She said gently",
    "time": "2020-05-24T14:06:36"
  },
  {
    "sender": "partner",
    "text": "Carter smiles softly “Unless you want to stay?”",
    "time": "2020-05-24T14:06:37"
  },
  {
    "sender": "you",
    "text": "Kai blushed hard. “Oh um yeah, sure.” She said softly.",
    "time": "2020-05-24T14:06:38"
  },
  {
    "sender": "partner",
    "text": "“Can we leave?” Carter whispers",
    "time": "2020-05-24T14:06:39"
  },
  {
    "sender": "you",
    "text": "Kai nodded and just cuddled into him gently",
    "time": "2020-05-24T14:06:40"
  },
  {
    "sender": "partner",
    "text": "“It’s not your fault” he says softly",
    "time": "2020-05-24T14:06:41"
  },
  {
    "sender": "you",
    "text": "Kai slowly pulled away. “I’m sorry about Christina...”",
    "time": "2020-05-24T14:06:42"
  },
  {
    "sender": "partner",
    "text": "Carter kisses back gently, holding her close",
    "time": "2020-05-24T14:06:43"
  },
  {
    "sender": "you",
    "text": "Kai nodded and kissed him softly wiping his tears.",
    "time": "2020-05-24T14:06:44"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “It’s okay. I’ll be okay, so long as I have you. Are you okay?”",
    "time": "2020-05-24T14:06:45"
  },
  {
    "sender": "you",
    "text": "Kai held him. “I’m sorry. I shouldn’t have said anything.” She said softly.",
    "time": "2020-05-24T14:06:46"
  },
  {
    "sender": "partner",
    "text": "Carter leans against her weakly “That went worse than I expected”",
    "time": "2020-05-24T14:06:47"
  },
  {
    "sender": "you",
    "text": "Kai looked over at him, and took his hand silent leading him out the room like a supportive girlfriend.",
    "time": "2020-05-24T14:06:48"
  },
  {
    "sender": "partner",
    "text": "Carter doesn’t look at her, crying silently",
    "time": "2020-05-24T14:06:49"
  },
  {
    "sender": "you",
    "text": "Everyone watched as Christins looked over at carter heartbroken",
    "time": "2020-05-24T14:06:50"
  },
  {
    "sender": "partner",
    "text": "Carter looks down sadly",
    "time": "2020-05-24T14:06:51"
  },
  {
    "sender": "you",
    "text": "Christins got pissed off. “Oh please, you have no proof.” || kai smirked. “Oh really?” She got the recording and played it out loud for everyone to hear",
    "time": "2020-05-24T14:06:52"
  },
  {
    "sender": "partner",
    "text": "Carter looks away hurt. He didn’t want people to get hurt, but he was now realising that wasn’t going to be possible.",
    "time": "2020-05-24T14:06:53"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip. When it got back to her and her friend, she nodded at the game plan. || “Has Christina been a good girlfriend to Carter?” One girl asked her. || Everyone got quite as Kai answered. “Hell no” she said rolling her eyes. || Christina got mad and stood up. “What the fuck? Of course I have. You’re just mad because he’s your soulmate but still he’d rather be with me.” || Kai laughed and stood up. “Oh please. We both know you cheated on him. Letting Lucas rawdog you while he was sleeping over with your brother.” She said mad by how upset she got carter.",
    "time": "2020-05-24T14:06:54"
  },
  {
    "sender": "partner",
    "text": "Carter looks up at her shyly and relaxes slightly",
    "time": "2020-05-24T14:06:55"
  },
  {
    "sender": "you",
    "text": "Kai noticed and didn’t care anymore. She reaches over and held his hand, rubbing her thumb on the back of it, giving him a reassuring look to calm him down.",
    "time": "2020-05-24T14:06:56"
  },
  {
    "sender": "partner",
    "text": "Carter was hyperventilating slightly",
    "time": "2020-05-24T14:06:57"
  },
  {
    "sender": "you",
    "text": "Kai just glanced over at carter, worried about him.",
    "time": "2020-05-24T14:06:58"
  },
  {
    "sender": "partner",
    "text": "River asks someone",
    "time": "2020-05-24T14:06:59"
  },
  {
    "sender": "you",
    "text": "Kai looked at him waiting on him to ask someone.",
    "time": "2020-05-24T14:07:00"
  },
  {
    "sender": "partner",
    "text": "Carter was looking down too. This wasn’t going as he had planned. // River looks at Kai",
    "time": "2020-05-24T14:07:01"
  },
  {
    "sender": "you",
    "text": "Kai just looked down. || Christina nodded. “Neither did I, until just now....”",
    "time": "2020-05-24T14:07:02"
  },
  {
    "sender": "partner",
    "text": "River looks between the two “No, I didn’t know”",
    "time": "2020-05-24T14:07:03"
  },
  {
    "sender": "you",
    "text": "Kai’s eyes do too as her mouth opened a little in surprise. || Christina looked at river, waiting on an answer.",
    "time": "2020-05-24T14:07:04"
  },
  {
    "sender": "partner",
    "text": "River’s eyes widen slightly // Carter’s eyes do too",
    "time": "2020-05-24T14:07:05"
  },
  {
    "sender": "you",
    "text": "Kai looked at carter worried. || “did you know that carter and kaiya both see blue?” She asked looked at him before looking between carter and kaiya.",
    "time": "2020-05-24T14:07:06"
  },
  {
    "sender": "partner",
    "text": "“Truth” River says",
    "time": "2020-05-24T14:07:07"
  },
  {
    "sender": "you",
    "text": "Christins just thought about it then nodded. “River, truth or dare...”",
    "time": "2020-05-24T14:07:08"
  },
  {
    "sender": "partner",
    "text": "Carter gently holds her hand, his heart broken too",
    "time": "2020-05-24T14:07:09"
  },
  {
    "sender": "you",
    "text": "Christins heard and looked heartbroken as her eyes started watering a bit. She kept it together for the party. || Kai looked worried.",
    "time": "2020-05-24T14:07:10"
  },
  {
    "sender": "partner",
    "text": "“I see blue” he whispers so only she could hear",
    "time": "2020-05-24T14:07:11"
  },
  {
    "sender": "you",
    "text": "Christina looked worried seeing his face. She held his hand rubbing it. “What’s wrong?”",
    "time": "2020-05-24T14:07:12"
  },
  {
    "sender": "partner",
    "text": "Carter’s eyes widen and he looks down sadly",
    "time": "2020-05-24T14:07:13"
  },
  {
    "sender": "you",
    "text": "Christina tilted her head at the question as everyone stopped surprised he has the nerve to ask. “I see yellow” she said gently. || Kai’s eyes widened hearing him ask in front of so many people.",
    "time": "2020-05-24T14:07:14"
  },
  {
    "sender": "partner",
    "text": "“What colour do you see?” Carter asks softly",
    "time": "2020-05-24T14:07:15"
  },
  {
    "sender": "you",
    "text": "Christina cuddled into him. “Truth” she said. || Kai smiled gently and bit her lip.",
    "time": "2020-05-24T14:07:16"
  },
  {
    "sender": "partner",
    "text": "Carter looks at Christina “Truth or Dare”",
    "time": "2020-05-24T14:07:17"
  },
  {
    "sender": "you",
    "text": "Kai couldn’t helped but blush. || the host looked at carter waiting on him to ask someone",
    "time": "2020-05-24T14:07:18"
  },
  {
    "sender": "partner",
    "text": "He looks at Kai",
    "time": "2020-05-24T14:07:19"
  },
  {
    "sender": "partner",
    "text": "Carter smiles shyly and sits back down",
    "time": "2020-05-24T14:07:20"
  },
  {
    "sender": "you",
    "text": "Kai pulled away slowly biting her lip. || everyone had been watching intrigued by their undeniable chemistry.",
    "time": "2020-05-24T14:07:21"
  },
  {
    "sender": "partner",
    "text": "Carter cups her cheek for a second before pulling away reluctantly",
    "time": "2020-05-24T14:07:22"
  },
  {
    "sender": "you",
    "text": "Christina looked away getting jealous. || River watched them jealous as well. || Kai smiled against his lips as she kissed him softly.",
    "time": "2020-05-24T14:07:23"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her tenderly",
    "time": "2020-05-24T14:07:24"
  },
  {
    "sender": "you",
    "text": "Kai giggled and kissed him back happily, not caring who was around at the moment.",
    "time": "2020-05-24T14:07:25"
  },
  {
    "sender": "partner",
    "text": "“Only because of the high recommendation her boyfriend gives” he walks over and gently kisses Kai",
    "time": "2020-05-24T14:07:26"
  },
  {
    "sender": "you",
    "text": "Christina noticed them two catch eyes and glared slightly. || Kai just Gabe him a slight nod.",
    "time": "2020-05-24T14:07:27"
  },
  {
    "sender": "partner",
    "text": "Carter asks permission with his eyes when they catch together",
    "time": "2020-05-24T14:07:28"
  },
  {
    "sender": "you",
    "text": "Kai watched biting her lip.",
    "time": "2020-05-24T14:07:29"
  },
  {
    "sender": "partner",
    "text": "Carter blushes and looks around // River rubs the side of her hip",
    "time": "2020-05-24T14:07:30"
  },
  {
    "sender": "you",
    "text": "The host smirked. “Out of everyone in the room, aside from your girlfriend, go kiss the girl you feel is the best fuck..” || Kai watched as river put his arm around her.",
    "time": "2020-05-24T14:07:31"
  },
  {
    "sender": "partner",
    "text": "when it comes to his turn",
    "time": "2020-05-24T14:07:32"
  },
  {
    "sender": "partner",
    "text": "“Dare” Carter says",
    "time": "2020-05-24T14:07:33"
  },
  {
    "sender": "you",
    "text": "The host smirked. “Truth or dare timeeee”",
    "time": "2020-05-24T14:07:34"
  },
  {
    "sender": "partner",
    "text": "Carter sits in the one beside them",
    "time": "2020-05-24T14:07:35"
  },
  {
    "sender": "you",
    "text": "Kai and river sat down in one of the loveseats together.",
    "time": "2020-05-24T14:07:36"
  },
  {
    "sender": "partner",
    "text": "Carter goes as Christina wanted to play too",
    "time": "2020-05-24T14:07:37"
  },
  {
    "sender": "you",
    "text": "Kai happily danced with softly of her friends having fun until the host called said it was game time. Kai dragged river into the room where they were playing spin the bottle.",
    "time": "2020-05-24T14:07:38"
  },
  {
    "sender": "partner",
    "text": "Carter sees and frowns",
    "time": "2020-05-24T14:07:39"
  },
  {
    "sender": "you",
    "text": "Kai was taking shots before going to dance on the dance.",
    "time": "2020-05-24T14:07:40"
  },
  {
    "sender": "partner",
    "text": "Carter blushes and kisses back",
    "time": "2020-05-24T14:07:41"
  },
  {
    "sender": "you",
    "text": "Christina comes over to him and kissed him deeply.",
    "time": "2020-05-24T14:07:42"
  },
  {
    "sender": "partner",
    "text": "Carter gets out and looks around // River watches Kai",
    "time": "2020-05-24T14:07:43"
  },
  {
    "sender": "you",
    "text": "Christina smiled softly and waited on him to get out of the car with her. ||Kai came in greeting people and downed a few shots.",
    "time": "2020-05-24T14:07:44"
  },
  {
    "sender": "partner",
    "text": "River looks at her // Carter frowns",
    "time": "2020-05-24T14:07:45"
  },
  {
    "sender": "you",
    "text": "Kai just readjusted her underwear and got out of the car heading into the party to get a much needed drink. || Christina just shook her head as they got to the party. “I’m fine love.” She said getting out of the car.",
    "time": "2020-05-24T14:07:46"
  },
  {
    "sender": "partner",
    "text": "“What’s wrong?” // River sighs and pulls his fingers out “Pronise?”",
    "time": "2020-05-24T14:07:47"
  },
  {
    "sender": "you",
    "text": "Christins heard him and held his hand back. She smiled gently. “ oh Um thanks...” || Kai bit her lip trying to get him to stop. “ river can we please do this later...” she said moaning.",
    "time": "2020-05-24T14:07:48"
  },
  {
    "sender": "partner",
    "text": "Carter holds her hand “I love your blue eyes” // River smirks “We can, we are”",
    "time": "2020-05-24T14:07:49"
  },
  {
    "sender": "you",
    "text": "Christina smiled softly but couldn’t help but think about the incident. || Kai shook her head still moaning. “W-we can’t...”",
    "time": "2020-05-24T14:07:50"
  },
  {
    "sender": "partner",
    "text": "Carter blushes happily // “But you like it. You want it.” He teases",
    "time": "2020-05-24T14:07:51"
  },
  {
    "sender": "you",
    "text": "Christina looked at him and couldn’t help but kiss his cheek. || Kai moaned shaking her head. “Ri-river, we shouldn’t...” she said trying to get her words out as her juices were all over his fingers.",
    "time": "2020-05-24T14:07:52"
  },
  {
    "sender": "partner",
    "text": "Carter smiles at her lovingly // River pumps his fingers in and out of her",
    "time": "2020-05-24T14:07:53"
  },
  {
    "sender": "you",
    "text": "Christina smiled softly and nodded looking over at him. || Kai gasped and moaned more, biting her lip.",
    "time": "2020-05-24T14:07:54"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her cheek “I’ll always love you” // River pulls her panties aside and starts to finger her",
    "time": "2020-05-24T14:07:55"
  },
  {
    "sender": "you",
    "text": "Christins nodded and bit her lip hard. || Kai moaned softly turned on and held on to the car seat hard.",
    "time": "2020-05-24T14:07:56"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “I don’t know, we’ll never know I guess.” // River smirks and whispers in her ear “I can’t wait to get freaky with you tonight”",
    "time": "2020-05-24T14:07:57"
  },
  {
    "sender": "you",
    "text": "Christina looked worried. “So if she did, we’d never be together” || Kai moved her hips with his fingers moaning softly.",
    "time": "2020-05-24T14:07:58"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Of course. But she never returned those feelings. And I’m happy with you.” He half-lies // River smirks happily",
    "time": "2020-05-24T14:07:59"
  },
  {
    "sender": "you",
    "text": "Christina looked at him confused. “Wait, before we got together, you liked her?” || Kai felt it and moaned softly surprised by his haste.",
    "time": "2020-05-24T14:08:00"
  },
  {
    "sender": "partner",
    "text": "River rubs her through her panties as he drives // Carter shrugs “I did have feelings for her. But then she got River and I got you.”",
    "time": "2020-05-24T14:08:01"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip getting wet by what he was doing. || Christina looked at him. “You guys both aren’t ugly and you seem really close.” She said gently.",
    "time": "2020-05-24T14:08:02"
  },
  {
    "sender": "partner",
    "text": "River slowly moves his hand higher // Carter shakes his head “No. Why?”",
    "time": "2020-05-24T14:08:03"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly as she adjusted. ||    Christina smiled softly. “Did you guys ever get together?” She asked curiously.",
    "time": "2020-05-24T14:08:04"
  },
  {
    "sender": "partner",
    "text": "River rubs her thigh as he drives / “Since kindergarten”",
    "time": "2020-05-24T14:08:05"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip as she got out her blue chapstick, putting it on. || Christina looked over and winked at him. “Hey, so how long have you known Kaiya?”",
    "time": "2020-05-24T14:08:06"
  },
  {
    "sender": "partner",
    "text": "❤️",
    "time": "2020-05-24T14:08:07"
  },
  {
    "sender": "partner",
    "text": "River drives // Carter glances at Christina",
    "time": "2020-05-24T14:08:08"
  },
  {
    "sender": "you",
    "text": "Kai waited on river to drive off as she checked her phone. || Christina smiled softly texting happily",
    "time": "2020-05-24T14:08:09"
  },
  {
    "sender": "partner",
    "text": "He looks at Kai",
    "time": "2020-05-24T14:08:10"
  },
  {
    "sender": "partner",
    "text": "Carter gets in the driver’s seat// River gets in his car",
    "time": "2020-05-24T14:08:11"
  },
  {
    "sender": "you",
    "text": "Christina smiled softly. || Kai bit her lip and cuddled into the seat.",
    "time": "2020-05-24T14:08:12"
  },
  {
    "sender": "partner",
    "text": "River smiles “You’re welcome” // Carter helps her into the car",
    "time": "2020-05-24T14:08:13"
  },
  {
    "sender": "you",
    "text": "Christina was at carter’s waiting on him and she texted her phone.",
    "time": "2020-05-24T14:08:14"
  },
  {
    "sender": "you",
    "text": "Kai sighed as they got to river’s cat. “Oh thanks babe...”",
    "time": "2020-05-24T14:08:15"
  },
  {
    "sender": "partner",
    "text": "Carter glances back at Kai sadly // River smiles “You looked hot cheering for me”",
    "time": "2020-05-24T14:08:16"
  },
  {
    "sender": "you",
    "text": "Kai followed, glancing over at Carter. || Christina smiled heading to his car.",
    "time": "2020-05-24T14:08:17"
  },
  {
    "sender": "partner",
    "text": "Carter nods and holds her hand // River leads her to his car",
    "time": "2020-05-24T14:08:18"
  },
  {
    "sender": "you",
    "text": "Christina smiles, “lets go to the party” || Kai smiled and stayed cuddled into him. “Yeah, we should probably get going...”",
    "time": "2020-05-24T14:08:19"
  },
  {
    "sender": "partner",
    "text": "Carter smiles shyly “I love you too” // River smirks widely and winks at her",
    "time": "2020-05-24T14:08:20"
  },
  {
    "sender": "you",
    "text": "Christina smirked softly. “I love you so much.” She said || Kai blushed hard and giggled gently",
    "time": "2020-05-24T14:08:21"
  },
  {
    "sender": "partner",
    "text": "Carter blushes more “Someone’s excited” he whispers // River holds her hand and whispers “I can’t wait to have some fun with you later”",
    "time": "2020-05-24T14:08:22"
  },
  {
    "sender": "you",
    "text": "Christina smirked and started kissing his neck and whispered dirty things in his ear. || Kai giggled as their teammates came over cheering",
    "time": "2020-05-24T14:08:23"
  },
  {
    "sender": "partner",
    "text": "Carter smiles shyly “Thank you” // River smiles widley",
    "time": "2020-05-24T14:08:24"
  },
  {
    "sender": "you",
    "text": "Christina smirked. “You did great baby” she said eyeing him. || Kai smiled and bit her lip, looking in his eyes",
    "time": "2020-05-24T14:08:25"
  },
  {
    "sender": "partner",
    "text": "Carter blushes deeply // River pecks back happily",
    "time": "2020-05-24T14:08:26"
  },
  {
    "sender": "you",
    "text": "Christina smirked gently biting her lip as she pulled away from the kiss, staying close in his embrace. || Kai smiled softly and pecked his lips.",
    "time": "2020-05-24T14:08:27"
  },
  {
    "sender": "partner",
    "text": "River smiles “Thank you baby” he holds her close, his hand on her ass // Carter blushes deeply as he feels Christina feel him up",
    "time": "2020-05-24T14:08:28"
  },
  {
    "sender": "you",
    "text": "Kai smiled back. “Good job!” || Cristina kissed him more moaning sta in fted",
    "time": "2020-05-24T14:08:29"
  },
  {
    "sender": "partner",
    "text": "((This okay or do you want me just to rp Carter and Christina?))",
    "time": "2020-05-24T14:08:30"
  },
  {
    "sender": "partner",
    "text": "River hugs her tightly and gives her ass a squeeze // Carter kisses back surprised",
    "time": "2020-05-24T14:08:31"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly as River came and hugged her. She hugged back while she noticed Christina kiss him deep",
    "time": "2020-05-24T14:08:32"
  },
  {
    "sender": "partner",
    "text": "The boys walk over to the two girls",
    "time": "2020-05-24T14:08:33"
  },
  {
    "sender": "you",
    "text": "As the game ended, the boys won and everyone cheered.",
    "time": "2020-05-24T14:08:34"
  },
  {
    "sender": "partner",
    "text": "Carter can’t help but perv on her as she cheers",
    "time": "2020-05-24T14:08:35"
  },
  {
    "sender": "you",
    "text": "Kai did cheers as she was supposed to while they played",
    "time": "2020-05-24T14:08:36"
  },
  {
    "sender": "partner",
    "text": "Carter watches her // Christina cheers",
    "time": "2020-05-24T14:08:37"
  },
  {
    "sender": "you",
    "text": "Kai smiled and blushed gently. “I love you” she mouthed back as the game started.",
    "time": "2020-05-24T14:08:38"
  },
  {
    "sender": "partner",
    "text": "Carter smiles at Kai and mouths “You look beautiful” // Christina stretches and joins Kai",
    "time": "2020-05-24T14:08:39"
  },
  {
    "sender": "you",
    "text": "Kai came out to the field as she and the other cheerleaders started cheering",
    "time": "2020-05-24T14:08:40"
  },
  {
    "sender": "partner",
    "text": "Christina smiles happily and makes herself presentable before heading out // Carter goes onto the field too",
    "time": "2020-05-24T14:08:41"
  },
  {
    "sender": "you",
    "text": "Kai giggles. *im pretty sure your gf just masturbated in the bathroom* she texted after listening to the recording sent. ||River headed out to the field.",
    "time": "2020-05-24T14:08:42"
  },
  {
    "sender": "partner",
    "text": "Carter nods and hears that it was game time. He sends Kai the recording and a message wishing her good luck. // Christina goes to the toilet and finger fucks herself to a quiet climax, imagining her brother’s friend taking her forcibly",
    "time": "2020-05-24T14:08:43"
  },
  {
    "sender": "you",
    "text": "River nodded. “Yeah, I remember the spare room.” || Kai nodded as she heard it was time to get out to the field. She stopped her phone and sent him the recording.",
    "time": "2020-05-24T14:08:44"
  },
  {
    "sender": "partner",
    "text": "Carter nods “In the spare room. I’ve stopped over there loads of times so it’s not that weird.” // Christina thinks “At this point, I’m at least wanting my pussy ate.”",
    "time": "2020-05-24T14:08:45"
  },
  {
    "sender": "you",
    "text": "River nodded softly. “Oh yeah, you’re sleeping over at Kai’s aren’t you?” || Kai smiled gently noticing that her measurements were off. “So you plan on getting some after the game tonight?”",
    "time": "2020-05-24T14:08:46"
  },
  {
    "sender": "partner",
    "text": "“I need to be up early to let the plumbers in my house so they continue fixing my pipes.” // Christina looks at her “It’s like this long and this thick” she shows her, obviously a bit horny from the sex talk",
    "time": "2020-05-24T14:08:47"
  },
  {
    "sender": "you",
    "text": "River looked curious. “Hm why?” || Kai nodded. “I bet. I just didn’t think his penis would be as big as you say it is.”",
    "time": "2020-05-24T14:08:48"
  },
  {
    "sender": "partner",
    "text": "Christina shakes her head “Usually over the weekend. Trust me, I need the break after we’re done, he just makes me so sore.” She smirks happily, a wet patch forming on her panties",
    "time": "2020-05-24T14:08:49"
  },
  {
    "sender": "you",
    "text": "Kai giggles. “I still think it’s crazy how you fuck Carter. Like do y’all have sex daily?” She asked curiously.",
    "time": "2020-05-24T14:08:50"
  },
  {
    "sender": "partner",
    "text": "Christina thinks “No. This pussy has been a Carter only zone. // Carter nods “Yeah, I’ll probably leave after a few hours though.”",
    "time": "2020-05-24T14:08:51"
  },
  {
    "sender": "you",
    "text": "Kai nodded. “And you didn’t do anything else with him since then?” || River smirked and nodded. “You ready for the party tonight?”",
    "time": "2020-05-24T14:08:52"
  },
  {
    "sender": "partner",
    "text": "Christina nods “A few times” // “If you say so”",
    "time": "2020-05-24T14:08:53"
  },
  {
    "sender": "you",
    "text": "Kai nodded. “oh okayyy. So you haven’t seen the best friend since?” She asked curious. || River chuckled. “If I get her super wet, she will.”",
    "time": "2020-05-24T14:08:54"
  },
  {
    "sender": "partner",
    "text": "Christina shakes her head “One time, about two months into me and Carter. But I have thought about it a few times since then while I play with myself.” // “You think Kai would want break up sex?”",
    "time": "2020-05-24T14:08:55"
  },
  {
    "sender": "you",
    "text": "Kai looked at her. “So you kept cheating on him?” She asked surprised. “Couldn’t be me. River and I were like 2 peas in a pod.” || River shrugged. “I’ll just wait to make a move on her until after Kai and I split and have that nice ass break up sex.”",
    "time": "2020-05-24T14:08:56"
  },
  {
    "sender": "partner",
    "text": "Christina nods “For two months or so. And yeah, there wasn’t time to put one on. And once it started, I didn’t want it to stop.” // Carter looks at him “What about the other girl?”",
    "time": "2020-05-24T14:08:57"
  },
  {
    "sender": "you",
    "text": "Kai choked on air. “Wait this was when you and carter were dating? And you let him hit raw....” she said gently. || River shrugged. “Nah, I’ll just wait until she decides to stop lying to me about what color she sees. Until then I’m gonna keep loving on her and fucking that nice pussy.” He said excited.",
    "time": "2020-05-24T14:08:58"
  },
  {
    "sender": "partner",
    "text": "Christina shakes her head “How do you tell a guy you cheated with someone seven years older than you and let him hit you raw when you insist he always wear a condom?” // Carter nods “So you’re breaking up with Kai?”",
    "time": "2020-05-24T14:08:59"
  },
  {
    "sender": "you",
    "text": "Kai looked surprised. “Oh my god... that sounds hot but like did you never tell Carter?” She asked gently. || River shrugged. “I was planning to propose to Kai on prom night but if she’s not the one then what’s the point?”",
    "time": "2020-05-24T14:09:00"
  },
  {
    "sender": "partner",
    "text": "(He as in Carter)",
    "time": "2020-05-24T14:09:01"
  },
  {
    "sender": "partner",
    "text": "He starts to secretly record just in case",
    "time": "2020-05-24T14:09:02"
  },
  {
    "sender": "partner",
    "text": "“My older brother’s best friend. He was so hunky, I just snuck in my brother’s room, pulled his bottoms down and rode him until he came in my pussy. Then he just fucked me for hours.” // Carter’s eyes widen “So you’re going to marry the other girl?”",
    "time": "2020-05-24T14:09:03"
  },
  {
    "sender": "you",
    "text": "Kai almost choked on air. “Wait what? Then who did?” She asked shook. || River shrugged. “I don’t know. I’m gonna miss dating Kai though. It gave me a lot of street cred around here.”",
    "time": "2020-05-24T14:09:04"
  },
  {
    "sender": "partner",
    "text": "Christina smirks playfully “Carter didn’t take my virginity” // Carter nods “And which girl is that?” He says playfully",
    "time": "2020-05-24T14:09:05"
  },
  {
    "sender": "you",
    "text": "Kai giggled and smiled. “Hm impressive. Sure, what’s up?” She asked as she thought back to Christina’s birthday. || River thought. “Yeah, so life is good right now. I got my gorgeous girl on my arm for a bit longer, then afterwards I have my future wife...”",
    "time": "2020-05-24T14:09:06"
  },
  {
    "sender": "partner",
    "text": "Christina shakes her head “It was on my birthday the next year. Even then, he was so big. I felt sore for days but god he was great. But want to know a secret?” // Carter nods",
    "time": "2020-05-24T14:09:07"
  },
  {
    "sender": "you",
    "text": "River nodded. “Yeah, fair enough”",
    "time": "2020-05-24T14:09:08"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “Question: when did you and carter first start having sex? My bet is that night you invited him to your house.” || River",
    "time": "2020-05-24T14:09:09"
  },
  {
    "sender": "partner",
    "text": "Christina nods “He adores me. And I, him.” // Carter shrugs “You know how it is, we think one thing, they see things differently. I think they’re going good, she might say differently for all I know.”",
    "time": "2020-05-24T14:09:10"
  },
  {
    "sender": "you",
    "text": "Kai got a text just as she said that trying not to roll her eyes. She pressed the record button on her phone then put her phone in her bag. “You really think he’s that wrapped around your finger, huh?” She asked curiously, looking amused. || River looked at him. “So what about you and Christina huh? How’s that going?”",
    "time": "2020-05-24T14:09:11"
  },
  {
    "sender": "partner",
    "text": "Carter hides his disgust and texts Kai *He still wants you. But he also has found another girl that works for his dad.* // Christina nods “You know he’ll do anything for me. So if I ask, he’ll provide.”",
    "time": "2020-05-24T14:09:12"
  },
  {
    "sender": "you",
    "text": "River shrugged. “Well if she hasn’t told me, then there’s a reason. I’ll just wait until she tells me. But until then, I’ll just enjoy the perks of dating her sexy ass. God I swear that girl has an amazing pussy. Like it’s something extraordinary.” He said smirking as he thought about it. || Kai heard her and raised an eyebrow. “You think he’ll go for that?”",
    "time": "2020-05-24T14:09:13"
  },
  {
    "sender": "partner",
    "text": "Carter shakes his head “She knows what colour it is. She thanked me a few days ago for picking up her scrunchie, says she’s fond of her blue one and would hate to lose it.” // Christina nods “I’m definitely getting some break up sex when we end it”",
    "time": "2020-05-24T14:09:14"
  },
  {
    "sender": "you",
    "text": "River smirked. “Eh, she probably can’t even tell what she’s putting on.” He said thinking about her putting on lingerie. || Kai heard Christina and kept changing, getting a little jealous. “Oh so y’all are sexually actively?”",
    "time": "2020-05-24T14:09:15"
  },
  {
    "sender": "partner",
    "text": "Carter shrugs “I don’t know” // Christina nods again “Like he’s such kind and caring, and god the things he does to me in bed. I swear sometimes he literally can fuck my brains out.”",
    "time": "2020-05-24T14:09:16"
  },
  {
    "sender": "you",
    "text": "River looked at him confused. “She wears blue? Why would she wear a color she can’t see?” He asked. || Kai nodded and sighed. “I felt that....”",
    "time": "2020-05-24T14:09:17"
  },
  {
    "sender": "partner",
    "text": "Christina nods “I just don’t want to break his heart” // Carter shakes his head “I thought she saw blue considering how much of it she wears”",
    "time": "2020-05-24T14:09:18"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip. “At least you know now though...that makes your life easier” || River looked at him. “shades of red and like peach, why? She’s always seen that color since we were kids.”",
    "time": "2020-05-24T14:09:19"
  },
  {
    "sender": "partner",
    "text": "Christina nods // Carter frowns “What colour does Kai see?”",
    "time": "2020-05-24T14:09:20"
  },
  {
    "sender": "you",
    "text": "Kai thought for a second. “Oh, I’m sorry. So you think he sees blue...” || River shrugged. “I guess I glitched the system cause I even started seeing color with Kai yesterday...”",
    "time": "2020-05-24T14:09:21"
  },
  {
    "sender": "partner",
    "text": "Christina looks at her “Because he asked me to pass him his blue Gatorade, and I always thought it was yellow...” // “But people don’t have two soulmates...”",
    "time": "2020-05-24T14:09:22"
  },
  {
    "sender": "you",
    "text": "Kai heard and paused mid change. “Wait what? I-I mean how do you find that?” She asked gently. || River shrugged. “She works for my dad’s company and she’s super sweet. Everything about her is perfect. And she sees the same color as me. Which I’m so confused about. It’s cool that I have two soulmates though. Ya know, since Kai sees the same color too...”",
    "time": "2020-05-24T14:09:23"
  },
  {
    "sender": "partner",
    "text": "Christina looks at her and waves back “Okay I guess. I just... I feel like something is off. Maybe it’s just my mind, but I think he doesn’t see the same colour as me?” // Carter looks down “Tell me about this girl”",
    "time": "2020-05-24T14:09:24"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly as she saw Christina and waved. “Oh hey, how’s it going with Carter?” She asked || River bit his lip. “Yeah, speaking of. I love Kai, but I met this girl the other day and she just blew my mind...” he started talking to the boys.",
    "time": "2020-05-24T14:09:25"
  },
  {
    "sender": "partner",
    "text": "Carter changes and talks to River, dropping hints about the colour thing",
    "time": "2020-05-24T14:09:26"
  },
  {
    "sender": "you",
    "text": "Kai got interrogated by the girls as they all think she was with river",
    "time": "2020-05-24T14:09:27"
  },
  {
    "sender": "partner",
    "text": "Carter kisses back shyly and goes to change too",
    "time": "2020-05-24T14:09:28"
  },
  {
    "sender": "you",
    "text": "Kai nodded and kissed him one last time. “Good luck tonight” she said cutely and walked out the closet, heading to the locker room.",
    "time": "2020-05-24T14:09:29"
  },
  {
    "sender": "partner",
    "text": "Carter sees and looks down “End of our alone time?”",
    "time": "2020-05-24T14:09:30"
  },
  {
    "sender": "you",
    "text": "Kai heard her phone go off. She checked it and sighed",
    "time": "2020-05-24T14:09:31"
  },
  {
    "sender": "partner",
    "text": "Carter looks back into hers shyly, holding her clsoe",
    "time": "2020-05-24T14:09:32"
  },
  {
    "sender": "you",
    "text": "Kai smiled staring in his eyes for a little.",
    "time": "2020-05-24T14:09:33"
  },
  {
    "sender": "partner",
    "text": "Carter pecks back just as happily, not wanting to leave the moment",
    "time": "2020-05-24T14:09:34"
  },
  {
    "sender": "you",
    "text": "Kai pecks his lips happily.",
    "time": "2020-05-24T14:09:35"
  },
  {
    "sender": "partner",
    "text": "Carter blushes \"Nothing\" he smiles back shyly",
    "time": "2020-05-24T14:09:36"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “What?” She asked softly, looking up at him and smiling.",
    "time": "2020-05-24T14:09:37"
  },
  {
    "sender": "partner",
    "text": "❤️",
    "time": "2020-05-24T14:09:38"
  },
  {
    "sender": "partner",
    "text": "he says weakly, not wanting her to be sad",
    "time": "2020-05-24T14:09:39"
  },
  {
    "sender": "partner",
    "text": "Carter sees and frowns slightly “Talk to me”",
    "time": "2020-05-24T14:09:40"
  },
  {
    "sender": "you",
    "text": "Kai sighed and looked down playing with her fingers.",
    "time": "2020-05-24T14:09:41"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “Because he knows if he does, he’ll lose you”",
    "time": "2020-05-24T14:09:42"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip. “Why is River not realizing?” She asked wondering.",
    "time": "2020-05-24T14:09:43"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Plus I think she’s going to want some space to think, I think she’s realising about the colours.”",
    "time": "2020-05-24T14:09:44"
  },
  {
    "sender": "you",
    "text": "Kai nodded. “Yeah, fair enough”",
    "time": "2020-05-24T14:09:45"
  },
  {
    "sender": "partner",
    "text": "Carter nods “She knows I’m staying at yours, and you know she isn’t a big drinker and such”",
    "time": "2020-05-24T14:09:46"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip. “Are you gonna be able to get away from Christina?”",
    "time": "2020-05-24T14:09:47"
  },
  {
    "sender": "partner",
    "text": "Carter nods “After that then” he says softly",
    "time": "2020-05-24T14:09:48"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “If you want. Remember, that big party is tonight...”",
    "time": "2020-05-24T14:09:49"
  },
  {
    "sender": "partner",
    "text": "He caresses her cheek “Should I come over tonight?”",
    "time": "2020-05-24T14:09:50"
  },
  {
    "sender": "partner",
    "text": "Carter holds her “I love you” he whispers",
    "time": "2020-05-24T14:09:51"
  },
  {
    "sender": "you",
    "text": "Kai snuggled into him gently enjoying it for as long as she could.",
    "time": "2020-05-24T14:09:52"
  },
  {
    "sender": "partner",
    "text": "Carter pecks back happily “Thank you honey” he smiles widely",
    "time": "2020-05-24T14:09:53"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and pecked his lips. “Good luck tonight love.”",
    "time": "2020-05-24T14:09:54"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles “Well, I have been your fairytale princess for donkeys’ years.”",
    "time": "2020-05-24T14:09:55"
  },
  {
    "sender": "you",
    "text": "Kai giggles and smiled happily. “You’re so cheesy” she said playfully hitting him.",
    "time": "2020-05-24T14:09:56"
  },
  {
    "sender": "partner",
    "text": "Carter cuddles back, stroking her hair “You’re mine, and I can’t wait to tell the world”",
    "time": "2020-05-24T14:09:57"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and hugged him, cuddling into him. She just wanted to be in his embrace.",
    "time": "2020-05-24T14:09:58"
  },
  {
    "sender": "partner",
    "text": "Carter blushes under her gaze “I love you too” he says shyly",
    "time": "2020-05-24T14:09:59"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and pulled away. “I love you” she said softly and looked in his eyes.",
    "time": "2020-05-24T14:10:00"
  },
  {
    "sender": "partner",
    "text": "Carter adds his tongue, his hands caressing her body through her dress",
    "time": "2020-05-24T14:10:01"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard and kissed him back, running her hands through his hair, enjoying his presence.",
    "time": "2020-05-24T14:10:02"
  },
  {
    "sender": "partner",
    "text": "Carter grins and gets the message, pressing her to the wall, kissing her passionately",
    "time": "2020-05-24T14:10:03"
  },
  {
    "sender": "you",
    "text": "Kai nodded and giggled. Before he had to go change for the game, she pulled him into the janitors closet blushing.",
    "time": "2020-05-24T14:10:04"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her cheek and whispers “We’re okay, right?”",
    "time": "2020-05-24T14:10:05"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly as it was finally the end of the day and they had to get ready",
    "time": "2020-05-24T14:10:06"
  },
  {
    "sender": "partner",
    "text": "Carter grins and squeezes her hand gently",
    "time": "2020-05-24T14:10:07"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and blushed hard. “Thank you” she spoke gently.",
    "time": "2020-05-24T14:10:08"
  },
  {
    "sender": "partner",
    "text": "\"You're so beautiful\" he whispers",
    "time": "2020-05-24T14:10:09"
  },
  {
    "sender": "partner",
    "text": "Carter glances back at her and winks playfully",
    "time": "2020-05-24T14:10:10"
  },
  {
    "sender": "you",
    "text": "Kai smiled happily and bit her lip as they worked. She glanced over at him",
    "time": "2020-05-24T14:10:11"
  },
  {
    "sender": "partner",
    "text": "Carter slowly entwines their fingers as they work",
    "time": "2020-05-24T14:10:12"
  },
  {
    "sender": "you",
    "text": "Kai continually held his hand happily",
    "time": "2020-05-24T14:10:13"
  },
  {
    "sender": "partner",
    "text": "Carter smiles and does the same, not wanting to disturb her peace",
    "time": "2020-05-24T14:10:14"
  },
  {
    "sender": "you",
    "text": "Kai was just working on their assignment quietly.",
    "time": "2020-05-24T14:10:15"
  },
  {
    "sender": "partner",
    "text": "Carter listens to her humming as they work, glancing at her occasionally",
    "time": "2020-05-24T14:10:16"
  },
  {
    "sender": "you",
    "text": "Kai blushes gently and held his hand sweetly. She hummed softly to calm herself.",
    "time": "2020-05-24T14:10:17"
  },
  {
    "sender": "partner",
    "text": "He makes notes, leaning against her slightly",
    "time": "2020-05-24T14:10:18"
  },
  {
    "sender": "partner",
    "text": "Carter sits beside her and holds her free hand under the table",
    "time": "2020-05-24T14:10:19"
  },
  {
    "sender": "you",
    "text": "Kai giggles and blushed at him smiling as they sat down.",
    "time": "2020-05-24T14:10:20"
  },
  {
    "sender": "partner",
    "text": "Carter blushes softly and looks down shyly “Sorry”",
    "time": "2020-05-24T14:10:21"
  },
  {
    "sender": "you",
    "text": "Kai sighed softly and looked at him. “Carter, I love you. So don’t act like River has an edge over you.” She said as they walked into class",
    "time": "2020-05-24T14:10:22"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her hurt \"Can we change the subject?\"",
    "time": "2020-05-24T14:10:23"
  },
  {
    "sender": "you",
    "text": "Kai looked at him and sighed. She just shook her head and headed to their class. “Look he was there for me when you weren’t. You couldn’t even tell I was hurting.”",
    "time": "2020-05-24T14:10:24"
  },
  {
    "sender": "partner",
    "text": "“And then look what happened with my home life. You pushing me away just that little bit was the start of a year of pain and hurt for me. And thinking you didn’t like me the way I liked you was the most painful bit of it all.”",
    "time": "2020-05-24T14:10:25"
  },
  {
    "sender": "partner",
    "text": "Carter stops walking and takes her hands “You did. We used to go to my house every day after school. Until one day, when I waited for you as usual, you didn’t turn up. The same the next day. And the week after that. And on that last day, Christina asked me to hers. So I went. I don’t know what happened, but you did stop spending time with me.”",
    "time": "2020-05-24T14:10:26"
  },
  {
    "sender": "you",
    "text": "Kai shook her head. “I didn’t push you away...” she said softly. “I stopped talking to you because you started dating her.”",
    "time": "2020-05-24T14:10:27"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “And Christina was there for me when I had a crush on you and you pushed me away and stopped spending time with me...” he points out sadly",
    "time": "2020-05-24T14:10:28"
  },
  {
    "sender": "you",
    "text": "Kai sighed. “Look Carter, it’s going to be hard because River was there for me when you chose Christina over me when I had a crush on you for so long. I was heartbroken and he was there.” She said softly explaining it to him.",
    "time": "2020-05-24T14:10:29"
  },
  {
    "sender": "partner",
    "text": "“It’s going to be harder for you to break up with River than it’s going to be for me and Christina, isn’t it?” Carter says softly “Like I’ve already started the ball rolling, but you’re letting him touch you up and kiss your neck.” It was obvious in his voice that he was sad and scared that she might choose River over him",
    "time": "2020-05-24T14:10:30"
  },
  {
    "sender": "you",
    "text": "Kai stood up and headed to class with him. “Yeah, what’s up?”",
    "time": "2020-05-24T14:10:31"
  },
  {
    "sender": "partner",
    "text": "“Kai?” Carter asks softly as they walk",
    "time": "2020-05-24T14:10:32"
  },
  {
    "sender": "partner",
    "text": "River reluctantly lets her go // Carter walks over as he and Kai have class together",
    "time": "2020-05-24T14:10:33"
  },
  {
    "sender": "you",
    "text": "Kai looked sad and sighed softly just as the bell rang for lunch.",
    "time": "2020-05-24T14:10:34"
  },
  {
    "sender": "partner",
    "text": "Carter was trying to work out how to resolve the situation in the best way possible",
    "time": "2020-05-24T14:10:35"
  },
  {
    "sender": "partner",
    "text": "River leaves a hickey, his body pressed against her back // Carter glances at her sadly for a second",
    "time": "2020-05-24T14:10:36"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly, but couldn’t help but glance over at Carter, sort of wishing she could just be with him already.",
    "time": "2020-05-24T14:10:37"
  },
  {
    "sender": "partner",
    "text": "River kisses her neck again // Carter was more than willing to be like that with her. He thought their sex last night proved that.",
    "time": "2020-05-24T14:10:38"
  },
  {
    "sender": "you",
    "text": "Kai smiled happily as she looked up at him. Internally, she sighed. She knew she was going to miss this.",
    "time": "2020-05-24T14:10:39"
  },
  {
    "sender": "partner",
    "text": "River holds her close “You tease me”",
    "time": "2020-05-24T14:10:40"
  },
  {
    "sender": "you",
    "text": "Kai blushes and snuggled into him.",
    "time": "2020-05-24T14:10:41"
  },
  {
    "sender": "partner",
    "text": "River nods “Exactly. And how can I when you’re all I can think of?”",
    "time": "2020-05-24T14:10:42"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “You need to be focusing on the game tonight” she reminded him.",
    "time": "2020-05-24T14:10:43"
  },
  {
    "sender": "partner",
    "text": "River nods and rubs her thighs “You know what you do to me when you wear dresses”",
    "time": "2020-05-24T14:10:44"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard and laughed happily. “Oh, so it’s the dress huh?” She asked smirking",
    "time": "2020-05-24T14:10:45"
  },
  {
    "sender": "partner",
    "text": "River nods “Not randomly. You just look so good in that dress and I feel the need to take what’s mine.”",
    "time": "2020-05-24T14:10:46"
  },
  {
    "sender": "you",
    "text": "Kai smiled happily, “so you’re just randomly super horny huh?” She asked giggling happily.",
    "time": "2020-05-24T14:10:47"
  },
  {
    "sender": "partner",
    "text": "River shakes his head",
    "time": "2020-05-24T14:10:48"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard as her eyes widened. She looked at him. “Did you take viagra or something?”",
    "time": "2020-05-24T14:10:49"
  },
  {
    "sender": "partner",
    "text": "River looks at her “I want you, that’s all” he whispers",
    "time": "2020-05-24T14:10:50"
  },
  {
    "sender": "you",
    "text": "Kai smiled happily. “No but I’m really curious” she said gently and looked at him confused.",
    "time": "2020-05-24T14:10:51"
  },
  {
    "sender": "partner",
    "text": "River kisses back “Is that a bad thing?”",
    "time": "2020-05-24T14:10:52"
  },
  {
    "sender": "you",
    "text": "Kai nodded. “Yeah, but you’re normally never like this” she said cutely and pecked his lips.",
    "time": "2020-05-24T14:10:53"
  },
  {
    "sender": "partner",
    "text": "River smiles “Can’t a guy hold his girl?” He keeps kissing her neck, his fingers teasing her thighs // Carter was talking with Christina",
    "time": "2020-05-24T14:10:54"
  },
  {
    "sender": "you",
    "text": "Kai giggles cutely as river kissed up and down her neck. “Baby, what’s up with you?”",
    "time": "2020-05-24T14:10:55"
  },
  {
    "sender": "partner",
    "text": "// River was a bit more handsy than usual",
    "time": "2020-05-24T14:10:56"
  },
  {
    "sender": "partner",
    "text": "Carter arrives half an hour later and gives the story about the burst pipe at his house",
    "time": "2020-05-24T14:10:57"
  },
  {
    "sender": "you",
    "text": "Kai came to school at the beginning of lunch and relaxed with river. She noticed everything seemed less great today.",
    "time": "2020-05-24T14:10:58"
  },
  {
    "sender": "partner",
    "text": "Carter drives to his own place and quickly changes before going to school himself",
    "time": "2020-05-24T14:10:59"
  },
  {
    "sender": "you",
    "text": "Kai blew him a kiss before driving off and heading to school.",
    "time": "2020-05-24T14:11:00"
  },
  {
    "sender": "partner",
    "text": "Carter nods “I’ll miss you”",
    "time": "2020-05-24T14:11:01"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “I’ll see you there” she said as she got in her car.",
    "time": "2020-05-24T14:11:02"
  },
  {
    "sender": "partner",
    "text": "Carter pecks her lips and goes to his house to change",
    "time": "2020-05-24T14:11:03"
  },
  {
    "sender": "you",
    "text": "Kai giggles and finished eating before getting up to head to school",
    "time": "2020-05-24T14:11:04"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Okay, another time then”",
    "time": "2020-05-24T14:11:05"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard. “Baby, I won’t be able to walk if we do...”",
    "time": "2020-05-24T14:11:06"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “Want a quickie before we leave for school?”",
    "time": "2020-05-24T14:11:07"
  },
  {
    "sender": "you",
    "text": "Kai smirked and blushed hard gently nodding.",
    "time": "2020-05-24T14:11:08"
  },
  {
    "sender": "partner",
    "text": "Carter smiles “Best sex you’ve ever had?” He teases",
    "time": "2020-05-24T14:11:09"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard nodding as she ate. “It was amazing” she said blushing.",
    "time": "2020-05-24T14:11:10"
  },
  {
    "sender": "partner",
    "text": "“Did you enjoy last night?” He asks shyly",
    "time": "2020-05-24T14:11:11"
  },
  {
    "sender": "partner",
    "text": "Carter blushes deeply and leans against her slightly",
    "time": "2020-05-24T14:11:12"
  },
  {
    "sender": "you",
    "text": "Kai smiled gently and and kissed his cheek happily",
    "time": "2020-05-24T14:11:13"
  },
  {
    "sender": "partner",
    "text": "Carter sits beside her and eats too, his arm around her waist",
    "time": "2020-05-24T14:11:14"
  },
  {
    "sender": "you",
    "text": "Kai smiled and started eating happily",
    "time": "2020-05-24T14:11:15"
  },
  {
    "sender": "partner",
    "text": "He looks at her shyly",
    "time": "2020-05-24T14:11:16"
  },
  {
    "sender": "partner",
    "text": "*good",
    "time": "2020-05-24T14:11:17"
  },
  {
    "sender": "partner",
    "text": "Carter nods and hands her her plate “Godo”",
    "time": "2020-05-24T14:11:18"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and sat down. “Yeah I’m okay”",
    "time": "2020-05-24T14:11:19"
  },
  {
    "sender": "partner",
    "text": "Carter smiles “You okay?”",
    "time": "2020-05-24T14:11:20"
  },
  {
    "sender": "you",
    "text": "Kai nodded smiled gently. “Good plan”",
    "time": "2020-05-24T14:11:21"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Good. I’ll say I’ve sprung a leak at my house so I’m stopping at yours while it gets fixed.”",
    "time": "2020-05-24T14:11:22"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “You know it”",
    "time": "2020-05-24T14:11:23"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles “And me staying overnight?”",
    "time": "2020-05-24T14:11:24"
  },
  {
    "sender": "you",
    "text": "Kai smiled and sat down for breakfast. Most definitely.",
    "time": "2020-05-24T14:11:25"
  },
  {
    "sender": "partner",
    "text": "Carter nods “A week of you teasing me, I bet”",
    "time": "2020-05-24T14:11:26"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “It’s only a week love”",
    "time": "2020-05-24T14:11:27"
  },
  {
    "sender": "partner",
    "text": "Carter smiles “It’s just a shame I can’t enjoy it fully just yet”",
    "time": "2020-05-24T14:11:28"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “Thank you” she said cutely.",
    "time": "2020-05-24T14:11:29"
  },
  {
    "sender": "partner",
    "text": "Carter pecks back happily “You look really good”",
    "time": "2020-05-24T14:11:30"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and cake and pecked his lips.",
    "time": "2020-05-24T14:11:31"
  },
  {
    "sender": "partner",
    "text": "Carter sees her and blushes deeply",
    "time": "2020-05-24T14:11:32"
  },
  {
    "sender": "you",
    "text": "Kai came down in a gorgeous dress.",
    "time": "2020-05-24T14:11:33"
  },
  {
    "sender": "partner",
    "text": "Carter plates up the food and waits",
    "time": "2020-05-24T14:11:34"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and bit her lip hard.",
    "time": "2020-05-24T14:11:35"
  },
  {
    "sender": "partner",
    "text": "He makes her favourite from when she was younger",
    "time": "2020-05-24T14:11:36"
  },
  {
    "sender": "partner",
    "text": "Carter didn’t know he had hurt her, and if he did, he would be sad",
    "time": "2020-05-24T14:11:37"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly even though her uterus was hurting",
    "time": "2020-05-24T14:11:38"
  },
  {
    "sender": "partner",
    "text": "Carter cooks them some breakfast",
    "time": "2020-05-24T14:11:39"
  },
  {
    "sender": "you",
    "text": "Kai went and took a shower ready to get cute",
    "time": "2020-05-24T14:11:40"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her for a second before getting dressed and heading out the room",
    "time": "2020-05-24T14:11:41"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard and smiled softly",
    "time": "2020-05-24T14:11:42"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Okay. I’ll go make breakfast or something then.” He says softly",
    "time": "2020-05-24T14:11:43"
  },
  {
    "sender": "partner",
    "text": "((Ohhhhh))",
    "time": "2020-05-24T14:11:44"
  },
  {
    "sender": "you",
    "text": "((She didn’t text River that))",
    "time": "2020-05-24T14:11:45"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and texted river. “I have to go shower love” she said cutely.",
    "time": "2020-05-24T14:11:46"
  },
  {
    "sender": "partner",
    "text": "Carter pecks back and looks up at her",
    "time": "2020-05-24T14:11:47"
  },
  {
    "sender": "you",
    "text": "Kai smiled and climbed on top of him smirking, as she pecked his lips",
    "time": "2020-05-24T14:11:48"
  },
  {
    "sender": "partner",
    "text": "Carter winks at her and finishes the conversation with Christina",
    "time": "2020-05-24T14:11:49"
  },
  {
    "sender": "you",
    "text": "Kai held in a giggle blushing hard",
    "time": "2020-05-24T14:11:50"
  },
  {
    "sender": "partner",
    "text": "Carter says through a cough he’ll be in school by lunch",
    "time": "2020-05-24T14:11:51"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly, confused at what he was doing.",
    "time": "2020-05-24T14:11:52"
  },
  {
    "sender": "partner",
    "text": "Carter kisses Kai’s cheek and answers the phone, pretending to be sick",
    "time": "2020-05-24T14:11:53"
  },
  {
    "sender": "you",
    "text": "Kai blushes gently. “To be fair, it was a sad movie.” She said gently the noticed river and Christina were calling them. She looked confused then checked the time, everyone was already in first period.",
    "time": "2020-05-24T14:11:54"
  },
  {
    "sender": "partner",
    "text": "Carter smiles “Except that one night after Bridge to Terebitha”",
    "time": "2020-05-24T14:11:55"
  },
  {
    "sender": "you",
    "text": "Kai nodded. “Of course. I always sleep well when you sleep over.”",
    "time": "2020-05-24T14:11:56"
  },
  {
    "sender": "partner",
    "text": "Carter grins and pecks her lips “Did you sleep well?”",
    "time": "2020-05-24T14:11:57"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard. “Good morning” she said gently, enjoying his cuddles.",
    "time": "2020-05-24T14:11:58"
  },
  {
    "sender": "partner",
    "text": "Carter blushes and slowly wakes up “Good morning princess” he says playfully",
    "time": "2020-05-24T14:11:59"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and pecked his cheek",
    "time": "2020-05-24T14:12:00"
  },
  {
    "sender": "partner",
    "text": "He looked happy and peaceful",
    "time": "2020-05-24T14:12:01"
  },
  {
    "sender": "partner",
    "text": "Carter was still asleep beside her, completely naked and snoring",
    "time": "2020-05-24T14:12:02"
  },
  {
    "sender": "you",
    "text": "Kai woke up the next morning, groaning, cause the sunlight was hitting her eyes and illuminating her room.",
    "time": "2020-05-24T14:12:03"
  },
  {
    "sender": "partner",
    "text": "Carter spoons her and falls asleep too, their bodies pressed together",
    "time": "2020-05-24T14:12:04"
  },
  {
    "sender": "you",
    "text": "Kai kissed him back before falling asleep in his arms since it was getting late.",
    "time": "2020-05-24T14:12:05"
  },
  {
    "sender": "partner",
    "text": "Carter smiles and presses a kiss to her lips “Good” he breathes in her smell",
    "time": "2020-05-24T14:12:06"
  },
  {
    "sender": "you",
    "text": "Kai was breathing deeply nodding as her eyes were slightly wide. “You were so ducking deep in me. It felt amazing.” She said happy that he was only hers.",
    "time": "2020-05-24T14:12:07"
  },
  {
    "sender": "partner",
    "text": "Carter cuddles back, holding her body close to his “Was I good?”",
    "time": "2020-05-24T14:12:08"
  },
  {
    "sender": "you",
    "text": "Once they were finished, Kai laid on the bed bed him, cuddling him as her uterus was super sore.",
    "time": "2020-05-24T14:12:09"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her hungrily as they make hard passionate love, her bed slamming against the wall with every thrust",
    "time": "2020-05-24T14:12:10"
  },
  {
    "sender": "you",
    "text": "Kai moaned happily, deeply in love with him and his passion for her. She could feel her juices getting everywhere, especially all over his dick.",
    "time": "2020-05-24T14:12:11"
  },
  {
    "sender": "partner",
    "text": "Carter starts going faster, until he was pounding into her passionately",
    "time": "2020-05-24T14:12:12"
  },
  {
    "sender": "you",
    "text": "Kai smirked as she looked back into his, wanting him to take her all he wanted.",
    "time": "2020-05-24T14:12:13"
  },
  {
    "sender": "partner",
    "text": "Carter looks into her eyes intensely as he slowly moves his hips back and forth",
    "time": "2020-05-24T14:12:14"
  },
  {
    "sender": "you",
    "text": "Kai felt it and let out a loud gasp like moan, surprised by his length.",
    "time": "2020-05-24T14:12:15"
  },
  {
    "sender": "partner",
    "text": "Carter slides into her, taking her for the first time. He stretched her insides.",
    "time": "2020-05-24T14:12:16"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip gently, trying to mentally prepare herself",
    "time": "2020-05-24T14:12:17"
  },
  {
    "sender": "partner",
    "text": "Carter smiles and climbs on top of her, his tip brushing against her womanhood",
    "time": "2020-05-24T14:12:18"
  },
  {
    "sender": "you",
    "text": "Kai looked at him, staring back. “Why would I want to?” She said teasing him, smirking softly.",
    "time": "2020-05-24T14:12:19"
  },
  {
    "sender": "partner",
    "text": "“Last chance to back out of this” he whispers",
    "time": "2020-05-24T14:12:20"
  },
  {
    "sender": "partner",
    "text": "Carter comes back and puts the condom on, starting into her eyes",
    "time": "2020-05-24T14:12:21"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard and smirked at the fact that he remembered where the condoms were.",
    "time": "2020-05-24T14:12:22"
  },
  {
    "sender": "partner",
    "text": "He was already hard for her",
    "time": "2020-05-24T14:12:23"
  },
  {
    "sender": "partner",
    "text": "Carter smirks more and gets a condom from her bathroom",
    "time": "2020-05-24T14:12:24"
  },
  {
    "sender": "you",
    "text": "Kai heard his voice and bit her lip hard. “I want you” she moaned.",
    "time": "2020-05-24T14:12:25"
  },
  {
    "sender": "partner",
    "text": "“Yes babygirl?” Carter smirks against her womanhood",
    "time": "2020-05-24T14:12:26"
  },
  {
    "sender": "you",
    "text": "Kai moaned more, her wetness increasing as she gasped. “Fuck daddy” she moaned softly.",
    "time": "2020-05-24T14:12:27"
  },
  {
    "sender": "partner",
    "text": "Carter holds her legs open and starts to tongue fuck her",
    "time": "2020-05-24T14:12:28"
  },
  {
    "sender": "you",
    "text": "Kai’s eyes were rolling to the back of her head as she moaned. “Please give it to me...”",
    "time": "2020-05-24T14:12:29"
  },
  {
    "sender": "partner",
    "text": "Carter twitches inside his boxers, exploring her insides with his mouth",
    "time": "2020-05-24T14:12:30"
  },
  {
    "sender": "you",
    "text": "Kai moaned happily. “Carter...” she moaned his name sexily.",
    "time": "2020-05-24T14:12:31"
  },
  {
    "sender": "partner",
    "text": "Carter slides his tongue inside her, his face buried against her crotch",
    "time": "2020-05-24T14:12:32"
  },
  {
    "sender": "you",
    "text": "Kai closed her eyes gasping gently as she felt it start to enter her.",
    "time": "2020-05-24T14:12:33"
  },
  {
    "sender": "partner",
    "text": "Carter doesn’t stop, the tip of his tongue entering her slightly",
    "time": "2020-05-24T14:12:34"
  },
  {
    "sender": "you",
    "text": "Kai moaned more running her hands through his hair, knowing she was close to Cumming",
    "time": "2020-05-24T14:12:35"
  },
  {
    "sender": "partner",
    "text": "Carter rubs her ass as he eats her out, his nose nuzzling her clit",
    "time": "2020-05-24T14:12:36"
  },
  {
    "sender": "you",
    "text": "Kai’s back arched as she moaned at how well he could pleasure her with his tongue.",
    "time": "2020-05-24T14:12:37"
  },
  {
    "sender": "partner",
    "text": "Carter uses all the tricks he knew, being well versed in cunnilingus",
    "time": "2020-05-24T14:12:38"
  },
  {
    "sender": "you",
    "text": "Kai held on to her bed sheets, closing her eyes as she enjoyed the pleasure he was giving.",
    "time": "2020-05-24T14:12:39"
  },
  {
    "sender": "partner",
    "text": "Carter gently licks her, tasting her sweet nectar",
    "time": "2020-05-24T14:12:40"
  },
  {
    "sender": "you",
    "text": "Kai felt it and gasped, moaning as she felt his tongue start to lick her womanhood",
    "time": "2020-05-24T14:12:41"
  },
  {
    "sender": "partner",
    "text": "He lays on his front and pulls her onto his tongue, licking up her wetness",
    "time": "2020-05-24T14:12:42"
  },
  {
    "sender": "you",
    "text": "Kai eyes him as she laid back since it seemed like he knew what he wanted.",
    "time": "2020-05-24T14:12:43"
  },
  {
    "sender": "partner",
    "text": "He wanted to taste her for the first time",
    "time": "2020-05-24T14:12:44"
  },
  {
    "sender": "partner",
    "text": "Carter sees her moistness and parts her legs slowly",
    "time": "2020-05-24T14:12:45"
  },
  {
    "sender": "you",
    "text": "Kai eyes his manhood surprised by his actions. She bit her lip, getting moist by the second.",
    "time": "2020-05-24T14:12:46"
  },
  {
    "sender": "partner",
    "text": "Carter gets up and takes off his boxers so they were both naked",
    "time": "2020-05-24T14:12:47"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard as she eyed him, trying to evaluate what he was thinking.",
    "time": "2020-05-24T14:12:48"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her naked body, his eyes full of love and lust",
    "time": "2020-05-24T14:12:49"
  },
  {
    "sender": "you",
    "text": "Kai gasped as her body was revealed, and she blushed hard, still giggling from his tickling.",
    "time": "2020-05-24T14:12:50"
  },
  {
    "sender": "partner",
    "text": "Carter pulls off her nightgown and chucks it to the side",
    "time": "2020-05-24T14:12:51"
  },
  {
    "sender": "you",
    "text": "Kai moaned softly at his kisses as she giggled more falling back on the bed",
    "time": "2020-05-24T14:12:52"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her collarbone, still tickling her",
    "time": "2020-05-24T14:12:53"
  },
  {
    "sender": "you",
    "text": "Kai laughed more not even able to kiss back at that point.",
    "time": "2020-05-24T14:12:54"
  },
  {
    "sender": "partner",
    "text": "Carter tickles her, kissing her",
    "time": "2020-05-24T14:12:55"
  },
  {
    "sender": "you",
    "text": "Kai giggles in the kiss at his slight tickle.",
    "time": "2020-05-24T14:12:56"
  },
  {
    "sender": "partner",
    "text": "Carter’s tongue was all over hers as his hands tickle her hips again",
    "time": "2020-05-24T14:12:57"
  },
  {
    "sender": "you",
    "text": "Kai smirked against his lips, succeeding at distracting him.",
    "time": "2020-05-24T14:12:58"
  },
  {
    "sender": "partner",
    "text": "Carter kisses back deeply, still grinding against her",
    "time": "2020-05-24T14:12:59"
  },
  {
    "sender": "you",
    "text": "Kai continually French kissed him as she ran her hands through his hair.",
    "time": "2020-05-24T14:13:00"
  },
  {
    "sender": "partner",
    "text": "Carter French kisses back happily, her gown baring her belly",
    "time": "2020-05-24T14:13:01"
  },
  {
    "sender": "you",
    "text": "Kai kept laughing trying to distract him and decided to deeply French kiss him, to distract him.",
    "time": "2020-05-24T14:13:02"
  },
  {
    "sender": "partner",
    "text": "Carter keeps tickling her, pulling up her nightgown",
    "time": "2020-05-24T14:13:03"
  },
  {
    "sender": "you",
    "text": "Kai smirked and climbed on top of him laughing as she started to grind against him",
    "time": "2020-05-24T14:13:04"
  },
  {
    "sender": "partner",
    "text": "“Make me” Carter teases, smirking mischievously",
    "time": "2020-05-24T14:13:05"
  },
  {
    "sender": "you",
    "text": "Kai smiled. “Please stopppp” she whined while laughing.",
    "time": "2020-05-24T14:13:06"
  },
  {
    "sender": "partner",
    "text": "“Yes Kaiya?” He grins down at her",
    "time": "2020-05-24T14:13:07"
  },
  {
    "sender": "you",
    "text": "Kai laughed happily and called his name. “Carterrrr” she whined.",
    "time": "2020-05-24T14:13:08"
  },
  {
    "sender": "partner",
    "text": "*bed",
    "time": "2020-05-24T14:13:09"
  },
  {
    "sender": "partner",
    "text": "Carter keeps tickling her, his hands just about keeping her on the end",
    "time": "2020-05-24T14:13:10"
  },
  {
    "sender": "you",
    "text": "Kai laughed and almost fell off the bed cause she was laughing so hard",
    "time": "2020-05-24T14:13:11"
  },
  {
    "sender": "partner",
    "text": "Carter reaches around and tickles her “Now you have no protection”",
    "time": "2020-05-24T14:13:12"
  },
  {
    "sender": "you",
    "text": "Kai smiled gently and bit her lip happily.",
    "time": "2020-05-24T14:13:13"
  },
  {
    "sender": "partner",
    "text": "Carter nods “The Great Wall of Bed” he chuckles",
    "time": "2020-05-24T14:13:14"
  },
  {
    "sender": "you",
    "text": "Kai laughed. “Ah, I remember my many pillow wall experiences.”",
    "time": "2020-05-24T14:13:15"
  },
  {
    "sender": "partner",
    "text": "He grins and watches her",
    "time": "2020-05-24T14:13:16"
  },
  {
    "sender": "partner",
    "text": "Carter nods “True” he caresses her cheek “Doesn’t mean you can’t pillow wall me out.”",
    "time": "2020-05-24T14:13:17"
  },
  {
    "sender": "you",
    "text": "Kai laughed. “I’m pretty sure everything’s different now”",
    "time": "2020-05-24T14:13:18"
  },
  {
    "sender": "partner",
    "text": "Carter blushes “You’re welcome” he smiles back “Do old sleepover rules apply?”",
    "time": "2020-05-24T14:13:19"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and kissed his cheek softly. “Thank you” she said softly.",
    "time": "2020-05-24T14:13:20"
  },
  {
    "sender": "partner",
    "text": "Carter grins and strokes her hair slowly “You’re amazing”",
    "time": "2020-05-24T14:13:21"
  },
  {
    "sender": "you",
    "text": "Kai kisses him back happily and giggled cutely as she rested against him",
    "time": "2020-05-24T14:13:22"
  },
  {
    "sender": "partner",
    "text": "Carter kisses her gently and pulls her closer “Good”",
    "time": "2020-05-24T14:13:23"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly kissing him back. “Forever and always.”",
    "time": "2020-05-24T14:13:24"
  },
  {
    "sender": "partner",
    "text": "He looks into her eyes",
    "time": "2020-05-24T14:13:25"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles and pecks her lips happily “You’re my princess now?”",
    "time": "2020-05-24T14:13:26"
  },
  {
    "sender": "you",
    "text": "Kai smiled happily and giggled. “Of course. And what an amazing prince you were”",
    "time": "2020-05-24T14:13:27"
  },
  {
    "sender": "partner",
    "text": "Carter smiles “They put Sleeping Beauty on at kindergarten, and you wanted to Aurora, and as your best friend, I was contractually obligated to be your Philip.”",
    "time": "2020-05-24T14:13:28"
  },
  {
    "sender": "you",
    "text": "Kai blushes gently. “Yeah a little” she said thinking back to it.",
    "time": "2020-05-24T14:13:29"
  },
  {
    "sender": "partner",
    "text": "He looks at her shyly",
    "time": "2020-05-24T14:13:30"
  },
  {
    "sender": "partner",
    "text": "Carter runs a hand through her hair “Do you remember our first kiss?”",
    "time": "2020-05-24T14:13:31"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip and nodded gently, looking up at him.",
    "time": "2020-05-24T14:13:32"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Me too” he says softly",
    "time": "2020-05-24T14:13:33"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and kissed his cheek. “It’s okay. I just, I really hope they don’t take it too hard.”",
    "time": "2020-05-24T14:13:34"
  },
  {
    "sender": "partner",
    "text": "Carter nods and looks down “Sorry”",
    "time": "2020-05-24T14:13:35"
  },
  {
    "sender": "you",
    "text": "Kai looked at him confused. “Can we not talk about him?”",
    "time": "2020-05-24T14:13:36"
  },
  {
    "sender": "partner",
    "text": "Carter nods “What did he do right? So I know what not to not do.”",
    "time": "2020-05-24T14:13:37"
  },
  {
    "sender": "you",
    "text": "Kai shrugged. “Of course, a part of me will. Just like I’m sure you’ll miss Christina...”",
    "time": "2020-05-24T14:13:38"
  },
  {
    "sender": "partner",
    "text": "He looks at her shyly",
    "time": "2020-05-24T14:13:39"
  },
  {
    "sender": "partner",
    "text": "Carter holds her close “Will you miss him?”",
    "time": "2020-05-24T14:13:40"
  },
  {
    "sender": "you",
    "text": "Kai nodded pulling away and resting against his chest. “Yeah, it really does...”",
    "time": "2020-05-24T14:13:41"
  },
  {
    "sender": "partner",
    "text": "“This feels right” he whispers",
    "time": "2020-05-24T14:13:42"
  },
  {
    "sender": "partner",
    "text": "Carter deepens the kiss, pulling her on top of him gently, letting her have the control",
    "time": "2020-05-24T14:13:43"
  },
  {
    "sender": "you",
    "text": "Kai smiled against his lips, enjoying his embrace. She had longed for his touch for so long.",
    "time": "2020-05-24T14:13:44"
  },
  {
    "sender": "partner",
    "text": "He rubs her hips, their bodies tangling together",
    "time": "2020-05-24T14:13:45"
  },
  {
    "sender": "partner",
    "text": "Carter pulls her closer, his lips massaging hers",
    "time": "2020-05-24T14:13:46"
  },
  {
    "sender": "you",
    "text": "Kai felt it and kissed back softly, slowly falling back in love with him.",
    "time": "2020-05-24T14:13:47"
  },
  {
    "sender": "partner",
    "text": "Carter gets the message and gently kisses her",
    "time": "2020-05-24T14:13:48"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly, biting her lip. She looked into his eyes blushing more",
    "time": "2020-05-24T14:13:49"
  },
  {
    "sender": "partner",
    "text": "Carter cuddles back, his nose brushing against hers “Good” He was unaware she was wet",
    "time": "2020-05-24T14:13:50"
  },
  {
    "sender": "you",
    "text": "Kai turned on the lights and turning on her string lights before coming and cuddling into him. “Now I am” she said softly.",
    "time": "2020-05-24T14:13:51"
  },
  {
    "sender": "partner",
    "text": "He looks over at her “Comfy?”",
    "time": "2020-05-24T14:13:52"
  },
  {
    "sender": "partner",
    "text": "Carter folds up his clothes and lays on the covers beside her",
    "time": "2020-05-24T14:13:53"
  },
  {
    "sender": "you",
    "text": "Kai turned around and saw, eyeing him, biting her lip as she slowly got wet",
    "time": "2020-05-24T14:13:54"
  },
  {
    "sender": "partner",
    "text": "Carter slowly strips down to his boxers",
    "time": "2020-05-24T14:13:55"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly as she turned on the tv in her room.",
    "time": "2020-05-24T14:13:56"
  },
  {
    "sender": "partner",
    "text": "He looks up at her",
    "time": "2020-05-24T14:13:57"
  },
  {
    "sender": "partner",
    "text": "Carter nods and pulls off his shoes “Touché” he smiles shyly",
    "time": "2020-05-24T14:13:58"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard and smiled softly. “I mean I’ve basically been with you my entire life anyway...” she said softly",
    "time": "2020-05-24T14:13:59"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “Are you okay with being with me for the rest of your life?”",
    "time": "2020-05-24T14:14:00"
  },
  {
    "sender": "you",
    "text": "Kai heard him and looked at him blushing hard, speechless.",
    "time": "2020-05-24T14:14:01"
  },
  {
    "sender": "partner",
    "text": "Carter grins shyly and looks at her “Are you?”",
    "time": "2020-05-24T14:14:02"
  },
  {
    "sender": "you",
    "text": "Kai shrugged and led him into her room after taking his hand. “I guess so” she said smiling softly.",
    "time": "2020-05-24T14:14:03"
  },
  {
    "sender": "partner",
    "text": "“I guess she’s okay with it then?”",
    "time": "2020-05-24T14:14:04"
  },
  {
    "sender": "partner",
    "text": "Carter blushes crimson and looks at Kai",
    "time": "2020-05-24T14:14:05"
  },
  {
    "sender": "you",
    "text": "Kai blushes hard, her jaw dropping at what he said. || “be my guest. You’re going to have to on the honeymoon anyway. Might as well get practice in.” Her mom said, her freaky side coming out as she laughed and went back into her room.",
    "time": "2020-05-24T14:14:06"
  },
  {
    "sender": "partner",
    "text": "He says playfully",
    "time": "2020-05-24T14:14:07"
  },
  {
    "sender": "partner",
    "text": "Carter blushes deeply “Touché. But how do you know I won’t ravage your daughter?”",
    "time": "2020-05-24T14:14:08"
  },
  {
    "sender": "you",
    "text": "Her mom came out of the room. “Perfectly fine with it. You are her future husband after all” she said gently.",
    "time": "2020-05-24T14:14:09"
  },
  {
    "sender": "partner",
    "text": "“Is your mother okay with this?”",
    "time": "2020-05-24T14:14:10"
  },
  {
    "sender": "partner",
    "text": "Carter follows her up, trying not to check her out",
    "time": "2020-05-24T14:14:11"
  },
  {
    "sender": "you",
    "text": "Kai smiled and closed the door behind him heading to her room",
    "time": "2020-05-24T14:14:12"
  },
  {
    "sender": "partner",
    "text": "Carter blushes more and steps inside",
    "time": "2020-05-24T14:14:13"
  },
  {
    "sender": "you",
    "text": "Kai smiled and giggled letting him in. “Hi”",
    "time": "2020-05-24T14:14:14"
  },
  {
    "sender": "partner",
    "text": "Carter blushes when he sees her “Hi” he says shyly",
    "time": "2020-05-24T14:14:15"
  },
  {
    "sender": "you",
    "text": "Kai came down in her short night gown, opening the door.",
    "time": "2020-05-24T14:14:16"
  },
  {
    "sender": "partner",
    "text": "He knocks on the door",
    "time": "2020-05-24T14:14:17"
  },
  {
    "sender": "partner",
    "text": "Carter arrives ten minutes later",
    "time": "2020-05-24T14:14:18"
  },
  {
    "sender": "you",
    "text": "Her mom smirked. “Oooo great. More time spent with my son in law.” || Kai laughed and just rolled her eyes playfully at her mom.",
    "time": "2020-05-24T14:14:19"
  },
  {
    "sender": "partner",
    "text": "Carter puts Christina to bed and drives back to Kai’s",
    "time": "2020-05-24T14:14:20"
  },
  {
    "sender": "you",
    "text": "Kai got in her pjs and went to tell her mom. “Hey mom, Carter’s gonna come sleepover”",
    "time": "2020-05-24T14:14:21"
  },
  {
    "sender": "partner",
    "text": "River leaves // Carter smiles at Kai and drives Christina home",
    "time": "2020-05-24T14:14:22"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and said bye to river too.",
    "time": "2020-05-24T14:14:23"
  },
  {
    "sender": "partner",
    "text": "Carter says goodnight to River and Kai, then carries Christina to the car",
    "time": "2020-05-24T14:14:24"
  },
  {
    "sender": "you",
    "text": "Eventually Christina was getting tired and wanted to leave.",
    "time": "2020-05-24T14:14:25"
  },
  {
    "sender": "partner",
    "text": "River holds her",
    "time": "2020-05-24T14:14:26"
  },
  {
    "sender": "you",
    "text": "Kai then relaxed still in river’s embrace",
    "time": "2020-05-24T14:14:27"
  },
  {
    "sender": "partner",
    "text": "River kisses back happily // Carter holds Christina close",
    "time": "2020-05-24T14:14:28"
  },
  {
    "sender": "you",
    "text": "Kai smiled and pecked river’s lips happily.",
    "time": "2020-05-24T14:14:29"
  },
  {
    "sender": "partner",
    "text": "River chuckles “If you say so”",
    "time": "2020-05-24T14:14:30"
  },
  {
    "sender": "you",
    "text": "Kai blushes. “No reason. You guys just are good at it.” She said cutely.",
    "time": "2020-05-24T14:14:31"
  },
  {
    "sender": "partner",
    "text": "Carter and River both smile // “Why’s that babe?” river teases",
    "time": "2020-05-24T14:14:32"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “Can’t wait you see you guys play.” She said happily.",
    "time": "2020-05-24T14:14:33"
  },
  {
    "sender": "partner",
    "text": "((Okay. Good luck. 😘))",
    "time": "2020-05-24T14:14:34"
  },
  {
    "sender": "you",
    "text": "((Brb, got a college interview))",
    "time": "2020-05-24T14:14:35"
  },
  {
    "sender": "partner",
    "text": "Carter glances at her",
    "time": "2020-05-24T14:14:36"
  },
  {
    "sender": "partner",
    "text": "The boys both nod",
    "time": "2020-05-24T14:14:37"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “I heard there was an after party. We should definitely go.” She said happily.",
    "time": "2020-05-24T14:14:38"
  },
  {
    "sender": "partner",
    "text": "// River rubs her ass absentmindedly under the blanket",
    "time": "2020-05-24T14:14:39"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Of course”",
    "time": "2020-05-24T14:14:40"
  },
  {
    "sender": "you",
    "text": "Kai ate the candy. “You guys going to the game on Friday?” She asked.",
    "time": "2020-05-24T14:14:41"
  },
  {
    "sender": "partner",
    "text": "// Carter holds Christina close",
    "time": "2020-05-24T14:14:42"
  },
  {
    "sender": "partner",
    "text": "River holds her close",
    "time": "2020-05-24T14:14:43"
  },
  {
    "sender": "you",
    "text": "Kai nodded and kissed him back before grabbing some of the candy.",
    "time": "2020-05-24T14:14:44"
  },
  {
    "sender": "partner",
    "text": "“I understand babe” he kisses her",
    "time": "2020-05-24T14:14:45"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly, cuddling into him. “I’m sorry baby. I just haven’t been feeling too well.”",
    "time": "2020-05-24T14:14:46"
  },
  {
    "sender": "partner",
    "text": "River pulls her into his lap with a smile // Carter goes to the toilet and comes back downstairs",
    "time": "2020-05-24T14:14:47"
  },
  {
    "sender": "you",
    "text": "Kai giggles not even having noticed it until he fixed it. She came back downstairs and sat by River again",
    "time": "2020-05-24T14:14:48"
  },
  {
    "sender": "partner",
    "text": "Carter nods and puts her tube top back in place so that it’s wasn’t suspicious",
    "time": "2020-05-24T14:14:49"
  },
  {
    "sender": "you",
    "text": "Kai sighed. “We should probably get back downstairs.”",
    "time": "2020-05-24T14:14:50"
  },
  {
    "sender": "partner",
    "text": "Carter blushes when he feels her against him, especially when he notices her tube top",
    "time": "2020-05-24T14:14:51"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. She had to admit she did enjoy finally getting to be with him.",
    "time": "2020-05-24T14:14:52"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Okay” he says shyly, cuddling back against her",
    "time": "2020-05-24T14:14:53"
  },
  {
    "sender": "you",
    "text": "Kai cuddled into him. “Can you spend the night once you drop Christina off at home?” She asked gently.",
    "time": "2020-05-24T14:14:54"
  },
  {
    "sender": "partner",
    "text": "He sits beside her “It’s going to be okay”",
    "time": "2020-05-24T14:14:55"
  },
  {
    "sender": "partner",
    "text": "Carter shakes his head “Not today. They’ll be suspicious of me always going after you. Take the week, let them down gently.”",
    "time": "2020-05-24T14:14:56"
  },
  {
    "sender": "you",
    "text": "Kai sighed and sat on her bed. “Maybe you’re right. Maybe we should tell them.”",
    "time": "2020-05-24T14:14:57"
  },
  {
    "sender": "partner",
    "text": "“Because you’ve ran twice today in their presence; plus River thinks you’ve been off since this morning with the rose.”",
    "time": "2020-05-24T14:14:58"
  },
  {
    "sender": "you",
    "text": "Kai looked confused. “Wait why?” She asked.",
    "time": "2020-05-24T14:14:59"
  },
  {
    "sender": "partner",
    "text": "“They think you’re mad at them” Carter tries not to notice her tube top had ridden up",
    "time": "2020-05-24T14:15:00"
  },
  {
    "sender": "you",
    "text": "Kai looked at him. “ oh, um yes?” She asked gently.",
    "time": "2020-05-24T14:15:01"
  },
  {
    "sender": "partner",
    "text": "“Kai?”",
    "time": "2020-05-24T14:15:02"
  },
  {
    "sender": "partner",
    "text": "It was Carter",
    "time": "2020-05-24T14:15:03"
  },
  {
    "sender": "you",
    "text": "Kai expected it to be river and came and opened it.",
    "time": "2020-05-24T14:15:04"
  },
  {
    "sender": "partner",
    "text": "After a few minutes, there was a knock at her door",
    "time": "2020-05-24T14:15:05"
  },
  {
    "sender": "you",
    "text": "Kai went upstairs and into her room to clear her mind.",
    "time": "2020-05-24T14:15:06"
  },
  {
    "sender": "partner",
    "text": "Carter catches her glance and raises an eyebrow",
    "time": "2020-05-24T14:15:07"
  },
  {
    "sender": "you",
    "text": "Kai smiled and relaxed in rivers arms as she changed it to river dale. “I’ll be right back.” She said and then glanced at carter trying not to blush while she headed upstairs.",
    "time": "2020-05-24T14:15:08"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Sure” he smiles",
    "time": "2020-05-24T14:15:09"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “Hmmm, why don’t we just chill and relax and put on a tv show while we vibe.”",
    "time": "2020-05-24T14:15:10"
  },
  {
    "sender": "partner",
    "text": "“We could watch another? Or a gaming tourney?”",
    "time": "2020-05-24T14:15:11"
  },
  {
    "sender": "partner",
    "text": "Carter thinks",
    "time": "2020-05-24T14:15:12"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly. “So what should we do now?” She asks.",
    "time": "2020-05-24T14:15:13"
  },
  {
    "sender": "partner",
    "text": "After the film ends, their friends leave, so it was just the four of them",
    "time": "2020-05-24T14:15:14"
  },
  {
    "sender": "you",
    "text": "Kai glanced over at him before just staying in river’s embrace while watching the movie.",
    "time": "2020-05-24T14:15:15"
  },
  {
    "sender": "partner",
    "text": "River holds her again // Carter glances at her",
    "time": "2020-05-24T14:15:16"
  },
  {
    "sender": "you",
    "text": "Kai made sure to cover all 4 of them as she cuddled into the blanket.",
    "time": "2020-05-24T14:15:17"
  },
  {
    "sender": "partner",
    "text": "River looks at Kai slightly confused",
    "time": "2020-05-24T14:15:18"
  },
  {
    "sender": "you",
    "text": "Kai nodded. “Oh we can just share one since you’re right next to me” she said and grabbed the huge blanket that could probably cover all 4 of them then came and sat back on the couch.",
    "time": "2020-05-24T14:15:19"
  },
  {
    "sender": "partner",
    "text": "Carter asks for one",
    "time": "2020-05-24T14:15:20"
  },
  {
    "sender": "you",
    "text": "Kai suddenly gets cold. “I’m getting blankets. Does anyone want one?” She asked before going to the closet.",
    "time": "2020-05-24T14:15:21"
  },
  {
    "sender": "partner",
    "text": "River moves his hand higher up her thigh // Carter holds Christina",
    "time": "2020-05-24T14:15:22"
  },
  {
    "sender": "you",
    "text": "Kai couldn’t help but get slightly jealous even though it was her idea. She tried to focus on the movie.",
    "time": "2020-05-24T14:15:23"
  },
  {
    "sender": "partner",
    "text": "River rubs her thigh as they watch // Carter had his arm around Christina",
    "time": "2020-05-24T14:15:24"
  },
  {
    "sender": "you",
    "text": "Kai rested back against the couch gently.",
    "time": "2020-05-24T14:15:25"
  },
  {
    "sender": "partner",
    "text": "River nods and puts it on, his hand on her thigh",
    "time": "2020-05-24T14:15:26"
  },
  {
    "sender": "you",
    "text": "Kai brought out the snacks, putting them on the coffee table before sitting between river and carter on the couch. “Did you guys decide on a movie yet?”",
    "time": "2020-05-24T14:15:27"
  },
  {
    "sender": "partner",
    "text": "Carter was in the living room",
    "time": "2020-05-24T14:15:28"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly still blushing as she finished playing the snacks.",
    "time": "2020-05-24T14:15:29"
  },
  {
    "sender": "partner",
    "text": "Carter has one on her too back then but she didn’t show it but Christina did, which is why they got together",
    "time": "2020-05-24T14:15:30"
  },
  {
    "sender": "you",
    "text": "Kai blushed hard. She glanced over at him. When she thought back to it, it made sense that carter was her soulmate. She thought back to when she had a crush on him in middle school.",
    "time": "2020-05-24T14:15:31"
  },
  {
    "sender": "partner",
    "text": "Carter walks past her, his hand accidentally brushing her ass",
    "time": "2020-05-24T14:15:32"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and got some bowls and platters to put the snacks in.",
    "time": "2020-05-24T14:15:33"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles",
    "time": "2020-05-24T14:15:34"
  },
  {
    "sender": "you",
    "text": "Kai nodded gently. “By the way, my mom knows and she’s probably already planning our wedding.” She said and laughed as she got the snacks.",
    "time": "2020-05-24T14:15:35"
  },
  {
    "sender": "partner",
    "text": "Carter nods “Okay, you win”",
    "time": "2020-05-24T14:15:36"
  },
  {
    "sender": "you",
    "text": "Kai sighed. “How about we give it a week?”",
    "time": "2020-05-24T14:15:37"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “Keeping it from them would hurt them even more”",
    "time": "2020-05-24T14:15:38"
  },
  {
    "sender": "you",
    "text": "Kai looked at him worried. “But that would break their hearts...” she said scared.",
    "time": "2020-05-24T14:15:39"
  },
  {
    "sender": "partner",
    "text": "Carter looks back at her “Be honest with them”",
    "time": "2020-05-24T14:15:40"
  },
  {
    "sender": "you",
    "text": "Kai looked at him. “well what do you think we should do?”",
    "time": "2020-05-24T14:15:41"
  },
  {
    "sender": "partner",
    "text": "Carter nods and pulls his hand away gently “If that’s what you want”",
    "time": "2020-05-24T14:15:42"
  },
  {
    "sender": "you",
    "text": "Kai looked at him, his touch making her blush more. “We can’t tell Christina and river...” she said softly. “Maybe we can just ride it out and see how long until they figure it out...” she said softly, looking in his eyes.",
    "time": "2020-05-24T14:15:43"
  },
  {
    "sender": "partner",
    "text": "Carter nods and caresses her cheek gently “Well, this is a mess” he says nervously",
    "time": "2020-05-24T14:15:44"
  },
  {
    "sender": "you",
    "text": "Kai looked at him, biting her lip. “ ....w-we’re soulmates....”",
    "time": "2020-05-24T14:15:45"
  },
  {
    "sender": "partner",
    "text": "Carter nods and closes the door to the pantry so no one could hear them",
    "time": "2020-05-24T14:15:46"
  },
  {
    "sender": "you",
    "text": "Kai looked into his. “You know what that means, don’t you?” She asked gently.",
    "time": "2020-05-24T14:15:47"
  },
  {
    "sender": "partner",
    "text": "Carter looks into her eyes",
    "time": "2020-05-24T14:15:48"
  },
  {
    "sender": "you",
    "text": "Kai looked at him blushing hard. “Holy shit...” she said gently.",
    "time": "2020-05-24T14:15:49"
  },
  {
    "sender": "partner",
    "text": "Carter felt the same and looks at her confused",
    "time": "2020-05-24T14:15:50"
  },
  {
    "sender": "you",
    "text": "Kai blushes and felt a slight burst of colors. More than just blue. She stepped back surprised by it.",
    "time": "2020-05-24T14:15:51"
  },
  {
    "sender": "partner",
    "text": "Carter’s hand accidentally touches hers when they go for the same thing",
    "time": "2020-05-24T14:15:52"
  },
  {
    "sender": "you",
    "text": "Kai just looked around for what he said, grabbing some of the things.",
    "time": "2020-05-24T14:15:53"
  },
  {
    "sender": "partner",
    "text": "Carter tells her and walks over to help her",
    "time": "2020-05-24T14:15:54"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip. “What other snacks do we not have out?” She asked him from inside it.",
    "time": "2020-05-24T14:15:55"
  },
  {
    "sender": "partner",
    "text": "Carter was busy setting out the snacks",
    "time": "2020-05-24T14:15:56"
  },
  {
    "sender": "you",
    "text": "Kai came in the kitchen seeing carter. She blushed a little as she went and opened the walk in pantry.",
    "time": "2020-05-24T14:15:57"
  },
  {
    "sender": "partner",
    "text": "Carter smiles and hugs her back, helping with stuff until she went upstairs",
    "time": "2020-05-24T14:15:58"
  },
  {
    "sender": "you",
    "text": "Her mom smiled and gave Carter a hug. “Hi carter. So nice to see you and Christina again” she said letting them in. Sooner or later the rest of their friends arrived and their mom retreated upstairs.",
    "time": "2020-05-24T14:15:59"
  },
  {
    "sender": "partner",
    "text": "Carter sees her mom and smiles widely “Hello ma’am” he says warmly",
    "time": "2020-05-24T14:16:00"
  },
  {
    "sender": "you",
    "text": "Kai heard the car and nodded. “That’s him and Christina now...” || her mom nodded and went to get the door.",
    "time": "2020-05-24T14:16:01"
  },
  {
    "sender": "partner",
    "text": "Carter parks up outside of her house and helps Christina out the car",
    "time": "2020-05-24T14:16:02"
  },
  {
    "sender": "you",
    "text": "Her mom nodded. “Awh but that’s going to be so sweet once all this drama blows away. You and carter.... Awhhhh...” her mom said. || Kai rolled her eyes playfully.",
    "time": "2020-05-24T14:16:03"
  },
  {
    "sender": "partner",
    "text": "Carter was driving to her house, singing along to the radio",
    "time": "2020-05-24T14:16:04"
  },
  {
    "sender": "you",
    "text": "Kai smiled and got changed into a tube top and leggings, paired with fuzzy socks, in order to be more comfy. Her mom was making snacks for them as she came downstairs asking about Kai’s day. “Well I figured out Christina sees yellow, carter sees blue, and River sees Red.” She told her mom as she sat by the counter. || her mom looked at her surprised. “But you see blue...” || Kai nodded. “Now you see my dilemma.”",
    "time": "2020-05-24T14:16:05"
  },
  {
    "sender": "partner",
    "text": "Carter goes to Christina and drives them both to Kai’s house",
    "time": "2020-05-24T14:16:06"
  },
  {
    "sender": "you",
    "text": "Kai glanced over at him before heading out to her car, to meet their friends at her house.",
    "time": "2020-05-24T14:16:07"
  },
  {
    "sender": "partner",
    "text": "Carter was doing the same in his locker",
    "time": "2020-05-24T14:16:08"
  },
  {
    "sender": "you",
    "text": "After school, Kai was putting her things in her locker.",
    "time": "2020-05-24T14:16:09"
  },
  {
    "sender": "partner",
    "text": "Carter sighs and slowly gets up, going to class",
    "time": "2020-05-24T14:16:10"
  },
  {
    "sender": "you",
    "text": "Kai then realized he wasn’t lying about seeing blue right as the bell rang. “I’ll see you after school” she said softly, quickly getting up before he realized they were soulmates.",
    "time": "2020-05-24T14:16:11"
  },
  {
    "sender": "partner",
    "text": "Carter frowns and looks up at the sky “So we’re both screwed, huh?”",
    "time": "2020-05-24T14:16:12"
  },
  {
    "sender": "you",
    "text": "Kai shook her head. “No, she doesn’t. She sees yellow.” She said gently hoping he’d realize what she just did.",
    "time": "2020-05-24T14:16:13"
  },
  {
    "sender": "partner",
    "text": "“Blue, duh” he says softly",
    "time": "2020-05-24T14:16:14"
  },
  {
    "sender": "you",
    "text": "Kai looked at him. “What color does Christina see?” She asked gently.",
    "time": "2020-05-24T14:16:15"
  },
  {
    "sender": "partner",
    "text": "Carter looks away, betraying the truth in her statement",
    "time": "2020-05-24T14:16:16"
  },
  {
    "sender": "you",
    "text": "Kai noticed and sat up turning to him thinking. “You haven’t gone full color...”",
    "time": "2020-05-24T14:16:17"
  },
  {
    "sender": "partner",
    "text": "Carter looks and shrugs “Green?”",
    "time": "2020-05-24T14:16:18"
  },
  {
    "sender": "you",
    "text": "Kai looked confused. “Wait-“ she said softly putting two and two together. She knew Christina didn’t see blue. “Question. What color is my shirt?” She asked him. She knew it wasn’t blue.",
    "time": "2020-05-24T14:16:19"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “Blue” he says softly",
    "time": "2020-05-24T14:16:20"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and rested against him. “At least you have Christina. What color did you see before you two went full color?”",
    "time": "2020-05-24T14:16:21"
  },
  {
    "sender": "partner",
    "text": "Carter smiles and kisses her cheek “And I always will be”",
    "time": "2020-05-24T14:16:22"
  },
  {
    "sender": "you",
    "text": "Kai smiled softly and hugged on to him. “I know. You always have been.”",
    "time": "2020-05-24T14:16:23"
  },
  {
    "sender": "partner",
    "text": "Carter nods “I understand. Well, I’m here for you, as always.”",
    "time": "2020-05-24T14:16:24"
  },
  {
    "sender": "you",
    "text": "Kai looked worried. “Cause I love him. I don’t want to hurt him. Plus I just figured out this morning. It makes so much sense too because we both haven’t gone full color yet even though we’ve been together for awhile.”",
    "time": "2020-05-24T14:16:25"
  },
  {
    "sender": "partner",
    "text": "Carter frowns “Why haven’t you told him?”",
    "time": "2020-05-24T14:16:26"
  },
  {
    "sender": "you",
    "text": "Kai bit her lip. “River and I don’t see the same color. But he doesn’t know I see blue. He thinks we both see reds.” She said softly.",
    "time": "2020-05-24T14:16:27"
  },
  {
    "sender": "partner",
    "text": "Carter shakes his head “What?”",
    "time": "2020-05-24T14:16:28"
  },
  {
    "sender": "you",
    "text": "Kai looked at him biting her lip. “And you know that River sees only reds...” she said gently, biting her lip.",
    "time": "2020-05-24T14:16:29"
  },
  {
    "sender": "partner",
    "text": "Carter looks at her “I guess. Since you always wear it. Like your scrunchie.” He tugs on it slightly like he used to when they were younger.",
    "time": "2020-05-24T14:16:30"
  },
  {
    "sender": "you",
    "text": "Kai looked at him surprised. “You know that I see blue?” She asked softly.",
    "time": "2020-05-24T14:16:31"
  },
  {
    "sender": "partner",
    "text": "Carter lays beside her “Is it about the rose? If it is, it’s on me. He told me to get your favourite colour, so I got blue since that’s what you always wear and stuff. But if that’s wrong, I’m sorry.”((Told you I had an idea 😉))",
    "time": "2020-05-24T14:16:32"
  },
  {
    "sender": "you",
    "text": "Kai shook her head gently. “Nothing’s up” she said gently.",
    "time": "2020-05-24T14:16:33"
  },
  {
    "sender": "you",
    "text": "Ok",
    "time": "2020-05-24T14:16:34"
  },
  {
    "sender": "partner",
    "text": "((Oh. You can. Give me a sec. I have an idea, just refuse to tell him.))",
    "time": "2020-05-24T14:16:35"
  },
  {
    "sender": "you",
    "text": "((I was going to make that replace the art room scene but okay then 😂))",
    "time": "2020-05-24T14:16:36"
  },
  {
    "sender": "partner",
    "text": "Carter catches it and passes it to her “Come on Kai, don’t make me tickle it out of you”",
    "time": "2020-05-24T14:16:37"
  },
  {
    "sender": "you",
    "text": "Kaiya shook her head, as she was playing with her scrunchie, tossing it up and catching it, it fell onto him.",
    "time": "2020-05-24T14:16:38"
  },
  {
    "sender": "partner",
    "text": "Carter looks back at her “Liar” he says playfully “I know you, something’s up. Now spill.”",
    "time": "2020-05-24T14:16:39"
  },
  {
    "sender": "you",
    "text": "Kaiya just looked over at him. “Nothing” she said gently.",
    "time": "2020-05-24T14:16:40"
  },
  {
    "sender": "partner",
    "text": "Carter sits next to her and gently pokes her cheek “What’s wrong?”",
    "time": "2020-05-24T14:16:41"
  },
  {
    "sender": "you",
    "text": "Kaiya just laid down in the garden, feeling numb.",
    "time": "2020-05-24T14:16:42"
  },
  {
    "sender": "partner",
    "text": "“I’m going to see what” he slowly gets up and goes after her",
    "time": "2020-05-24T14:16:43"
  },
  {
    "sender": "you",
    "text": "Christina just shrugged. “Somethings definitely up with her”",
    "time": "2020-05-24T14:16:44"
  },
  {
    "sender": "partner",
    "text": "Carter looks at his girlfriend to see what she had to say about it",
    "time": "2020-05-24T14:16:45"
  },
  {
    "sender": "you",
    "text": "Kaiya just finished eating, then got up and left, not feeling like being there right now. She went and sat in the garden sighing, as she looked at the blue.",
    "time": "2020-05-24T14:16:46"
  },
  {
    "sender": "partner",
    "text": "Carter notices and raises an eyebrow at her",
    "time": "2020-05-24T14:16:47"
  },
  {
    "sender": "you",
    "text": "Kaiya doesn’t talk much as all their friends talk. She just sat there and ate.",
    "time": "2020-05-24T14:16:48"
  },
  {
    "sender": "partner",
    "text": "Carter eats his baguette quietly, talking to his girlfriend",
    "time": "2020-05-24T14:16:49"
  },
  {
    "sender": "you",
    "text": "Kaiya sighed as she got some candy and lemonade before heading over to them. || Her boyfriend pulled her into his lap, pecking her cheek, trying to make her happy. || She just put on a smile and cuddled into him.",
    "time": "2020-05-24T14:16:50"
  },
  {
    "sender": "partner",
    "text": "Carter thinks “Maybe. But it’s probably not you, she spent most of English in a day dream about you, it seemed.”",
    "time": "2020-05-24T14:16:51"
  },
  {
    "sender": "you",
    "text": "Kaiya went to the vending machine. || “hey, does Kai seem a little oof today?” He (her boyfriend) asked them confused and worried for her.",
    "time": "2020-05-24T14:16:52"
  },
  {
    "sender": "partner",
    "text": "All their friends were at their usual table",
    "time": "2020-05-24T14:16:53"
  },
  {
    "sender": "you",
    "text": "Kaiya just sighed biting her lip, once the bell rang, she headed to lunch.",
    "time": "2020-05-24T14:16:54"
  },
  {
    "sender": "partner",
    "text": "Carter works hard in his class, holding his girlfriend’s hand under the table",
    "time": "2020-05-24T14:16:55"
  },
  {
    "sender": "you",
    "text": "Kaiya was busy working the entire class trying to not think about everything",
    "time": "2020-05-24T14:16:56"
  },
  {
    "sender": "partner",
    "text": "Carter goes to his class; physics. He keeps his eye on Kaiya.",
    "time": "2020-05-24T14:16:57"
  },
  {
    "sender": "you",
    "text": "Once the bell rang, kaiya got up to go to chemistry, having ignored the fact that she still didn’t know what to do about her bf .",
    "time": "2020-05-24T14:16:58"
  },
  {
    "sender": "partner",
    "text": "Carter looked at her and thought she was flushed as she was horny *Okay* he texts back",
    "time": "2020-05-24T14:16:59"
  },
  {
    "sender": "you",
    "text": "Kaiya then hot out of it angry continued to relax with their friends. *we’re watching a movie after school* she texted",
    "time": "2020-05-24T14:17:00"
  },
  {
    "sender": "partner",
    "text": "Carter goes back to making notes, not wanting to disturb her sex day dream",
    "time": "2020-05-24T14:17:01"
  },
  {
    "sender": "partner",
    "text": "((Okay, good ☺️))",
    "time": "2020-05-24T14:17:02"
  },
  {
    "sender": "you",
    "text": "I’m only rping it with you rn",
    "time": "2020-05-24T14:17:03"
  },
  {
    "sender": "partner",
    "text": "((How many people replied to this?))",
    "time": "2020-05-24T14:17:04"
  },
  {
    "sender": "partner",
    "text": ", not wanting to disturb her sex day dream",
    "time": "2020-05-24T14:17:05"
  },
  {
    "sender": "partner",
    "text": "Carter goes back to making notes",
    "time": "2020-05-24T14:17:06"
  },
  {
    "sender": "you",
    "text": "Kaiya smiled and crossed her legs still thinking",
    "time": "2020-05-24T14:17:07"
  },
  {
    "sender": "partner",
    "text": "Carter notices her legs shuffle slightly as if she was trying to hide something between her legs",
    "time": "2020-05-24T14:17:08"
  },
  {
    "sender": "you",
    "text": "Kaiya shrugged. “We just make deep passionate love” she said thinking about her boyfriend.",
    "time": "2020-05-24T14:17:09"
  },
  {
    "sender": "partner",
    "text": "❤️",
    "time": "2020-05-24T14:17:10"
  },
  {
    "sender": "partner",
    "text": "Carter chuckles “What do you do then?”",
    "time": "2020-05-24T14:17:11"
  },
  {
    "sender": "you",
    "text": "Kaiya blushes hard and just jokingly looked away. “No pft”",
    "time": "2020-05-24T14:17:12"
  },
  {
    "sender": "partner",
    "text": "Carter nudges her back “Is that what you do? Kiss pictures?”",
    "time": "2020-05-24T14:17:13"
  },
  {
    "sender": "you",
    "text": "Kaiya shrugs. “I don’t know, she’s your girlfriend” she said playfully and nudged him.",
    "time": "2020-05-24T14:17:14"
  },
  {
    "sender": "partner",
    "text": "Carter laughs softly “But why pictures when the real thing is right here?”",
    "time": "2020-05-24T14:17:15"
  },
  {
    "sender": "you",
    "text": "Kaiya smiles softly. “Because she’s your girl friend and she looooovves youuuu” she said gently",
    "time": "2020-05-24T14:17:16"
  },
  {
    "sender": "partner",
    "text": "He keeps his eyes on her",
    "time": "2020-05-24T14:17:17"
  },
  {
    "sender": "partner",
    "text": "“Why pictures of me?” Carter chuckles",
    "time": "2020-05-24T14:17:18"
  },
  {
    "sender": "you",
    "text": "Kaiya smiles softly. “She’s probably in there kissing pictures of you” she said smirking and teased him.",
    "time": "2020-05-24T14:17:19"
  },
  {
    "sender": "partner",
    "text": "“Toilet I think” Carter looks at her",
    "time": "2020-05-24T14:17:20"
  },
  {
    "sender": "you",
    "text": "Kaiya smirked and laughed. “Where’s Christina?” She asked curious about his gf’s presence.",
    "time": "2020-05-24T14:17:21"
  },
  {
    "sender": "partner",
    "text": "❤️",
    "time": "2020-05-24T14:17:22"
  },
  {
    "sender": "partner",
    "text": "He smirks mischievously",
    "time": "2020-05-24T14:17:23"
  },
  {
    "sender": "partner",
    "text": "It hits him and he looks at her playfully “Really Kay?” He throws it back at her",
    "time": "2020-05-24T14:17:24"
  },
  {
    "sender": "you",
    "text": "Kaiya smiles as she got bored and crumpled up a paper ball, throwing it over at carter",
    "time": "2020-05-24T14:17:25"
  },
  {
    "sender": "partner",
    "text": "❤️",
    "time": "2020-05-24T14:17:26"
  },
  {
    "sender": "partner",
    "text": "“I’m down” he texts back. He loves her mom, who he had seen for donkey years, even if it was only because of her cooking.",
    "time": "2020-05-24T14:17:27"
  },
  {
    "sender": "you",
    "text": "They all texted in their groupchat. “You guys want to hangout at my house after school?” She texted in the chat",
    "time": "2020-05-24T14:17:28"
  },
  {
    "sender": "partner",
    "text": "Carter glances up at her and their friends as he works",
    "time": "2020-05-24T14:17:29"
  },
  {
    "sender": "you",
    "text": "Kaiya smiles softly, as their whole friend group had the same first block. Kaiya got into class and sat by him, her boyfriend, and their friends.",
    "time": "2020-05-24T14:17:30"
  },
  {
    "sender": "partner",
    "text": "He pulls out his notebook and starts to write his notes",
    "time": "2020-05-24T14:17:31"
  },
  {
    "sender": "partner",
    "text": "Carter goes to class too",
    "time": "2020-05-24T14:17:32"
  },
  {
    "sender": "you",
    "text": "Kaiya just put on lipgloss gently as she then heard the bell. She put her lipgloss up and headed to class.",
    "time": "2020-05-24T14:17:33"
  },
  {
    "sender": "partner",
    "text": "*get his",
    "time": "2020-05-24T14:17:34"
  },
  {
    "sender": "partner",
    "text": "Carter smiles softly and goes to his own locker to her his own books",
    "time": "2020-05-24T14:17:35"
  },
  {
    "sender": "you",
    "text": "Kaiya was at her locker getting her books as she sighed and bit her lip, thinking. She was saddened that he wasn’t her soulmate.",
    "time": "2020-05-24T14:17:36"
  },
  {
    "sender": "partner",
    "text": "Carter talks to his own girlfriend. They hadn’t done the colour thing as they’ve been together for so long that it seemed pointless to.",
    "time": "2020-05-24T14:17:37"
  },
  {
    "sender": "you",
    "text": "As the bell rang, Kaiya sighed and kissed his cheek before heading to her locker, letting her boyfriend talk to his friends.",
    "time": "2020-05-24T14:17:38"
  },
  {
    "sender": "partner",
    "text": "Carter pecks his girlfriend’s lips and holds her hand",
    "time": "2020-05-24T14:17:39"
  },
  {
    "sender": "partner",
    "text": "((Okay. We’ll see how we’ll feel when it comes to that.))",
    "time": "2020-05-24T14:17:40"
  },
  {
    "sender": "you",
    "text": "((Yeah, or maybe like ever since he figures out the color thing, their relationship hasn’t really had the same spark since he knows who his true soulmate is. And she maybe realizes later along and they have a talk)",
    "time": "2020-05-24T14:17:41"
  },
  {
    "sender": "partner",
    "text": "((Thank you ☺️ How are they going to break up then? Hopefully amicably, the colour thing helps.))",
    "time": "2020-05-24T14:17:42"
  },
  {
    "sender": "you",
    "text": "((Nope, Shes just gonna be a loving girlfriend cause you said you don’t want to rp cheating and stuff))",
    "time": "2020-05-24T14:17:43"
  },
  {
    "sender": "partner",
    "text": "Carter pecks his girlfriend’s lips and holds her hand((In our typical fashion, is his girlfriend pretending while she fucks around?))",
    "time": "2020-05-24T14:17:44"
  },
  {
    "sender": "you",
    "text": "Kaiya smiles softly as the bell was about to ring and she noticed carters girlfriend come over to him",
    "time": "2020-05-24T14:17:45"
  },
  {
    "sender": "partner",
    "text": "Carter was trying to ignore it, scrolling through Instagram on his phone while he waited. He had been friends with both of them since kindergarten, but always thought that they weren’t right for each other romantically.",
    "time": "2020-05-24T14:17:46"
  },
  {
    "sender": "you",
    "text": "She heard him say grey and just looked down at the scrunchie and nodded realizing that they weren’t soulmates. Scared to tell him, she just tried to ignore it.",
    "time": "2020-05-24T14:17:47"
  },
  {
    "sender": "you",
    "text": "As they were still talking, Kaiya was thinking for a second. “Hey baby, what color is this scrunchie on my wrist?” She asked gently and looked up hoping he said blue.",
    "time": "2020-05-24T14:17:48"
  },
  {
    "sender": "partner",
    "text": "((Want/need more of a response?))",
    "time": "2020-05-24T14:17:49"
  },
  {
    "sender": "partner",
    "text": "((You’re really going for the blue, huh? 😂😂😂))Carter watches his best friend give his girlfriend the rose he had asked him to get, telling him to get her favourite colour. So he did; blue. He leans against the wall as he watches them, keeping quiet as he checks his phone.",
    "time": "2020-05-24T14:17:50"
  },
  {
    "sender": "you",
    "text": "Kaiya pulled up into school and got out, looking as gorgeous as ever as usual. She looked around at the blue sky, and her blue scrunchie, in love with the color since it’s the only one she could really see. She then noticed her boyfriend and her friends coming over to her car as she got out. “Hi baby” she said as she hugged him and pecked his lips. || Suddenly, he gave her a peach rose and mentioning how they both saw peach. She smiled a little. “Right... it’s so pretty, thank you” she said as she just cuddled with him while they spoke with their friends.",
    "time": "2020-05-24T14:17:51"
  },
  {
    "sender": "partner",
    "text": "I know you are 😉🤣",
    "time": "2020-05-24T14:17:52"
  },
  {
    "sender": "you",
    "text": "Perf",
    "time": "2020-05-24T14:17:54"
  },
  {
    "sender": "partner",
    "text": "Okay. Sounds good. I can work with that. I have an idea already of how to start the romantic/sexual tension between our characters.",
    "time": "2020-05-24T14:17:55"
  },
  {
    "sender": "you",
    "text": "So I’ll start at school, like they’re all friends and stuff and then like we can do part 1 where her boyfriend gives her the flower at school",
    "time": "2020-05-24T14:17:56"
  },
  {
    "sender": "partner",
    "text": "Please. So I can get a sense of what I need to do. 😂 If you set the scene, ill do my best to work within those bounds.",
    "time": "2020-05-24T14:17:57"
  },
  {
    "sender": "you",
    "text": "Do you want me to start?",
    "time": "2020-05-24T14:17:58"
  },
  {
    "sender": "partner",
    "text": "☺️☺️☺️",
    "time": "2020-05-24T14:17:59"
  },
  {
    "sender": "you",
    "text": "Yesss",
    "time": "2020-05-24T14:18:00"
  },
  {
    "sender": "partner",
    "text": "You have? ☺️",
    "time": "2020-05-24T14:18:01"
  },
  {
    "sender": "you",
    "text": "Yay, I’ve missed you too ☺️",
    "time": "2020-05-24T14:18:02"
  },
  {
    "sender": "partner",
    "text": "Of course. I’ve missed rping with you. 😚",
    "time": "2020-05-24T14:18:03"
  },
  {
    "sender": "you",
    "text": "Shall we start?",
    "time": "2020-05-24T14:18:04"
  },
  {
    "sender": "you",
    "text": "Yesss",
    "time": "2020-05-24T14:18:05"
  },
  {
    "sender": "partner",
    "text": "Very true. We’ve had some good ones over the years 😂",
    "time": "2020-05-24T14:18:06"
  },
  {
    "sender": "you",
    "text": "Plus it’s cool to see how characters develop through different relationships",
    "time": "2020-05-24T14:18:07"
  },
  {
    "sender": "you",
    "text": "Yeah, idk why but it’s like less cliche",
    "time": "2020-05-24T14:18:08"
  },
  {
    "sender": "partner",
    "text": "Both our characters being in other relationships, drama happening then our characters ending up together. Not saying it’s a bad thing, it’s merely an observation.",
    "time": "2020-05-24T14:18:09"
  },
  {
    "sender": "you",
    "text": "Wdym?",
    "time": "2020-05-24T14:18:10"
  },
  {
    "sender": "partner",
    "text": "Okay. You really have a thing for these kinds of rps, don’t you? 😂",
    "time": "2020-05-24T14:18:11"
  },
  {
    "sender": "you",
    "text": "Sure, let’s say you’re in a relationship also and you’ve been pretending that you can see your gfs color but you really can’t",
    "time": "2020-05-24T14:18:12"
  },
  {
    "sender": "partner",
    "text": "It’s up to you, you’re the boss here 😂",
    "time": "2020-05-24T14:18:13"
  },
  {
    "sender": "partner",
    "text": "That’s what I thought when I watched them. I’m proud you thought of me. ☺️",
    "time": "2020-05-24T14:18:14"
  },
  {
    "sender": "you",
    "text": "If we want, we could add a twist like you also are in a relationship with someone else",
    "time": "2020-05-24T14:18:15"
  },
  {
    "sender": "you",
    "text": "you would Rp the best friend perfectlyyyy",
    "time": "2020-05-24T14:18:16"
  },
  {
    "sender": "you",
    "text": "YESSSS",
    "time": "2020-05-24T14:18:17"
  },
  {
    "sender": "partner",
    "text": "😍",
    "time": "2020-05-24T14:18:18"
  },
  {
    "sender": "partner",
    "text": "((Okay. I’m down to do this. I’ve watched all three. 😂))",
    "time": "2020-05-24T14:18:20"
  },
  {
    "sender": "partner",
    "text": "showtimehttps://media2.giphy.com/media/v1.Y2lkPTAyZWZlMmI0Zjc5NjRmMGE5MmM5NDVhOGM1OThmZjNlMWUyZTU5ZGJkMDRkYjc0Mg/60rs20Xy0mwkqmmkDm/200.gif",
    "time": "2020-05-24T14:18:22"
  }
]